
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>chapter 05 数据库基础理论 · SQL概要与数据库理论</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Laglangyue">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-tomorrow.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/vue.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../chapter06/" />
    
    
    <link rel="prev" href="../chapter04/" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter01/">
            
                <a href="../chapter01/">
            
                    
                    chapter 01 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter02/">
            
                <a href="../chapter02/">
            
                    
                    chapter 02 增删改查CURD
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter03/">
            
                <a href="../chapter03/">
            
                    
                    chapter 03 SQL高级关键字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../chapter04/">
            
                <a href="../chapter04/">
            
                    
                    chapter 04 SQL函数
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="./">
            
                <a href="./">
            
                    
                    chapter 05 数据库基础理论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../chapter06/">
            
                <a href="../chapter06/">
            
                    
                    chapter 06 JDBC三层架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../chapter07/">
            
                <a href="../chapter07/">
            
                    
                    chapter 07 整合Mybatis
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="../chapter08/">
            
                <a href="../chapter08/">
            
                    
                    chapter 08 Redis详解
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >chapter 05 数据库基础理论</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="chapter-05-&#x6570;&#x636E;&#x5E93;&#x57FA;&#x7840;&#x7406;&#x8BBA;">Chapter 05. &#x6570;&#x636E;&#x5E93;&#x57FA;&#x7840;&#x7406;&#x8BBA;</h2>
<h3 id="51-&#x6570;&#x636E;&#x5E93;&#x57FA;&#x672C;&#x6982;&#x5FF5;">5.1 &#x6570;&#x636E;&#x5E93;&#x57FA;&#x672C;&#x6982;&#x5FF5;</h3>
<ul>
<li><p><strong>&#x6570;&#x636E;&#x5E93;</strong>&#xFF1A;</p>
<p>  &#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#x53EF;&#x89C6;&#x4E3A;&#x7535;&#x5B50;&#x5316;&#x7684;&#x6587;&#x4EF6;&#x67DC;&#x2014;&#x2014;&#x5B58;&#x50A8;&#x7535;&#x5B50;&#x6587;&#x4EF6;&#x7684;&#x5904;&#x6240;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5BF9;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8FD0;&#x884C;&#x65B0;&#x589E;&#x3001;&#x622A;&#x53D6;&#x3001;&#x66F4;&#x65B0;&#x3001;&#x5220;&#x9664;&#x7B49;&#x64CD;&#x4F5C;&#x3002;</p>
</li>
<li><p><strong>&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;</strong></p>
<p>   &#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF08;Database Management System&#xFF0C;&#x7B80;&#x79F0;DBMS&#xFF09;&#x662F;&#x4E3A;&#x7BA1;&#x7406;&#x6570;&#x636E;&#x5E93;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x7535;&#x8111;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x822C;&#x5177;&#x6709;&#x5B58;&#x50A8;&#x3001;&#x622A;&#x53D6;&#x3001;&#x5B89;&#x5168;&#x4FDD;&#x969C;&#x3001;&#x5907;&#x4EFD;&#x7B49;&#x57FA;&#x7840;&#x529F;&#x80FD;</p>
</li>
</ul>
<h3 id="52-&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;">5.2 &#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;</h3>
<h4 id="521-&#x7B80;&#x4ECB;">5.2.1 &#x7B80;&#x4ECB;</h4>
<p>&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x662F;&#x521B;&#x5EFA;&#x5728;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x57FA;&#x7840;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x501F;&#x52A9;&#x4E8E;&#x96C6;&#x5408;&#x4EE3;&#x6570;&#x7B49;&#x6570;&#x5B66;&#x6982;&#x5FF5;&#x548C;&#x65B9;&#x6CD5;&#x6765;&#x5904;&#x7406;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x5404;&#x79CD;&#x5B9E;&#x4F53;&#x4EE5;&#x53CA;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x5404;&#x79CD;&#x8054;&#x7CFB;&#x5747;&#x7528;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x6765;&#x8868;&#x793A; &#x5173;&#x7CFB;&#x6A21;&#x578B;&#x6307;&#x7684;&#x5C31;&#x662F;&#x4E8C;&#x7EF4;&#x8868;&#x683C;&#x6A21;&#x578B;&#xFF0C;&#x800C;&#x4E00;&#x4E2A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5C31;&#x662F;&#x7531;&#x4E8C;&#x7EF4;&#x8868;&#x53CA;&#x5176;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x6240;&#x7EC4;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7EC4;&#x7EC7;&#x3002;</p>
<p>&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x6982;&#x5FF5;&#xFF1A;</p>
<ul>
<li><strong>&#x5173;&#x7CFB;</strong>&#xFF1A;&#x4E00;&#x5F20;&#x4E8C;&#x7EF4;&#x8868;&#xFF0C;&#x6BCF;&#x4E2A;&#x5173;&#x7CFB;&#x90FD;&#x5177;&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x7CFB;&#x540D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8868;&#x540D;</li>
<li><strong>&#x5143;&#x7EC4;</strong>&#xFF1A;&#x4E8C;&#x7EF4;&#x8868;&#x4E2D;&#x7684;&#x4E00;&#x884C;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x88AB;&#x79F0;&#x4E3A;&#x8BB0;&#x5F55;</li>
<li><strong>&#x5C5E;&#x6027;</strong>&#xFF1A;&#x4E8C;&#x7EF4;&#x8868;&#x4E2D;&#x7684;&#x4E00;&#x5217;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x88AB;&#x79F0;&#x4E3A;&#x5B57;&#x6BB5;</li>
<li><strong>&#x57DF;</strong>&#xFF1A;&#x5C5E;&#x6027;&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x67D0;&#x4E00;&#x5217;&#x7684;&#x53D6;&#x503C;&#x9650;&#x5236;</li>
<li><strong>&#x5173;&#x952E;&#x5B57;</strong>&#xFF1A;&#x4E00;&#x7EC4;&#x53EF;&#x4EE5;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x5143;&#x7EC4;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5E38;&#x79F0;&#x4E3A;&#x4E3B;&#x952E;&#xFF0C;&#x7531;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5217;&#x7EC4;&#x6210;</li>
<li><strong>&#x5173;&#x7CFB;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x6307;&#x5BF9;&#x5173;&#x7CFB;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x5176;&#x683C;&#x5F0F;&#x4E3A;&#xFF1A;&#x5173;&#x7CFB;&#x540D;(&#x5C5E;&#x6027;1&#xFF0C;&#x5C5E;&#x6027;2&#xFF0C; ... ... &#xFF0C;&#x5C5E;&#x6027;N)&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6210;&#x4E3A;&#x8868;&#x7ED3;&#x6784;</li>
</ul>
<p>&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x90FD;&#x914D;&#x5907;&#x4E86;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#xFF08;ODBC&#xFF09;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x4EE4;&#x5404;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x95F4;&#x5F97;&#x4EE5;&#x4E92;&#x76F8;&#x96C6;&#x6210;&#x3002;</p>
<p>&#x5178;&#x578B;&#x4EE3;&#x8868;&#x6709;&#xFF1A;MySQL&#x3001;Oracle&#x3001;Microsoft SQL Server&#x3001;Access&#x53CA;PostgreSQL&#x7B49;</p>
<h4 id="522-&#x7279;&#x70B9;">5.2.2 &#x7279;&#x70B9;</h4>
<ul>
<li><p>&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#xFF1A;&#x4F20;&#x7EDF;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x91C7;&#x7528;&#x8868;&#x683C;&#x7684;&#x50A8;&#x5B58;&#x65B9;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x4EE5;&#x884C;&#x548C;&#x5217;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#xFF1B;</p>
</li>
<li><p>&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF1A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x6309;&#x7167;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x8868;&#x90FD;&#x5FC5;&#x987B;&#x5BF9;&#x5404;&#x4E2A;&#x5B57;&#x6BB5;&#x5B9A;&#x4E49;&#x597D;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x8868;&#x7684;&#x7ED3;&#x6784;&#xFF09;&#xFF0C;&#x518D;&#x6839;&#x636E;&#x8868;&#x7684;&#x7ED3;&#x6784;&#x5B58;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x5F62;&#x5F0F;&#x548C;&#x5185;&#x5BB9;&#x5728;&#x5B58;&#x5165;&#x6570;&#x636E;&#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x597D;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x8868;&#x7684;&#x53EF;&#x9760;&#x6027;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x90FD;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x4F46;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x4E00;&#x65E6;&#x5B58;&#x5165;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x8868;&#x7684;&#x7ED3;&#x6784;&#x5C31;&#x4F1A;&#x5341;&#x5206;&#x56F0;&#x96BE;&#x3002;</p>
</li>
<li><p>&#x5B58;&#x50A8;&#x89C4;&#x8303;&#xFF1A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x91CD;&#x590D;&#x3001;&#x89C4;&#x8303;&#x5316;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x5145;&#x5206;&#x5229;&#x7528;&#x597D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x628A;&#x6570;&#x636E;&#x6309;&#x7167;&#x6700;&#x5C0F;&#x5173;&#x7CFB;&#x8868;&#x7684;&#x5F62;&#x5F0F;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#xFF0C;&#x8FD9;&#x6837;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x7684;&#x5C31;&#x53EF;&#x4EE5;&#x53D8;&#x5F97;&#x5F88;&#x6E05;&#x6670;&#x3001;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E3B;&#x8981;&#x662F;&#x4E00;&#x5F20;&#x6570;&#x636E;&#x8868;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5982;&#x679C;&#x662F;&#x591A;&#x5F20;&#x8868;&#x60C5;&#x51B5;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x6D89;&#x53CA;&#x5230;&#x591A;&#x5F20;&#x6570;&#x636E;&#x8868;&#xFF0C;&#x6570;&#x636E;&#x8868;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x590D;&#x6742;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x968F;&#x7740;&#x6570;&#x636E;&#x8868;&#x6570;&#x91CF;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#x3002;</p>
</li>
<li><p>&#x6269;&#x5C55;&#x65B9;&#x5F0F;&#xFF1A;&#x7531;&#x4E8E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x8868;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x7684;&#x74F6;&#x9888;&#x51FA;&#x73B0;&#x5728;&#x591A;&#x5F20;&#x6570;&#x636E;&#x8868;&#x7684;&#x64CD;&#x4F5C;&#x4E2D;&#xFF0C;&#x800C;&#x4E14;&#x6570;&#x636E;&#x8868;&#x8D8A;&#x591A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x8D8A;&#x4E25;&#x91CD;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x7F13;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x80FD;&#x63D0;&#x9AD8;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9009;&#x62E9;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x6027;&#x80FD;&#x66F4;&#x9AD8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x4E00;&#x5B9A;&#x7684;&#x62D3;&#x5C55;&#x7A7A;&#x95F4;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x7684;&#x62D3;&#x5C55;&#x7A7A;&#x95F4;&#x4E00;&#x5B9A;&#x6709;&#x975E;&#x5E38;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x5177;&#x5907;&#x7EB5;&#x5411;&#x6269;&#x5C55;&#x80FD;&#x529B;&#x3002;</p>
</li>
<li><p>&#x67E5;&#x8BE2;&#x65B9;&#x5F0F;&#xFF1A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x91C7;&#x7528;&#x7ED3;&#x6784;&#x5316;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x6765;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#xFF0C;SQL&#x65E9;&#x5DF2;&#x83B7;&#x5F97;&#x4E86;&#x5404;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x6210;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x884C;&#x4E1A;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x652F;&#x6301;&#x6570;&#x636E;&#x5E93;&#x7684;CRUD&#xFF08;&#x589E;&#x52A0;&#xFF0C;&#x67E5;&#x8BE2;&#xFF0C;&#x66F4;&#x65B0;&#xFF0C;&#x5220;&#x9664;&#xFF09;&#x64CD;&#x4F5C;&#xFF0C;&#x5177;&#x6709;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x7684;&#x529F;&#x80FD;&#xFF0C;SQL&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x7C7B;&#x4F3C;&#x7D22;&#x5F15;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x52A0;&#x5FEB;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#x3002;</p>
</li>
<li><p>&#x89C4;&#x8303;&#x5316;&#xFF1A;&#x5728;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BBE;&#x8BA1;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x901A;&#x5E38;&#x4F1A;&#x9762;&#x5BF9;&#x540C;&#x65F6;&#x9700;&#x8981;&#x5BF9;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5B9E;&#x4F53;&#xFF08;&#x5305;&#x62EC;&#x6570;&#x7EC4;&#x3001;&#x5217;&#x8868;&#x548C;&#x5D4C;&#x5957;&#x6570;&#x636E;&#xFF09;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5B9E;&#x4F53;&#x4E00;&#x822C;&#x9996;&#x5148;&#x8981;&#x5206;&#x5272;&#x6210;&#x591A;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5BF9;&#x5206;&#x5272;&#x7684;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x89C4;&#x8303;&#x5316;&#xFF0C;&#x89C4;&#x8303;&#x5316;&#x4EE5;&#x540E;&#x518D;&#x5206;&#x522B;&#x5B58;&#x5165;&#x5230;&#x591A;&#x5F20;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x8868;&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x597D;&#x6D88;&#x606F;&#x662F;&#x968F;&#x7740;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x76F8;&#x5F53;&#x591A;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5E73;&#x53F0;&#x90FD;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x5229;&#x7528;ORM&#x5C42;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5BF9;&#x8C61;&#x5173;&#x7CFB;&#x6620;&#x5C04;&#xFF09;&#x6765;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x6620;&#x5C04;&#x5230;&#x57FA;&#x4E8E;SQL&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53BB;&#x4EE5;&#x53CA;&#x8FDB;&#x884C;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;&#x3002;</p>
</li>
<li><p>&#x4E8B;&#x52A1;&#x6027;&#xFF1A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5F3A;&#x8C03;ACID&#x89C4;&#x5219;&#xFF08;&#x539F;&#x5B50;&#x6027;&#xFF08;Atomicity&#xFF09;&#x3001;&#x4E00;&#x81F4;&#x6027;&#xFF08;Consistency&#xFF09;&#x3001;&#x9694;&#x79BB;&#x6027;&#xFF08;Isolation&#xFF09;&#x3001;&#x6301;&#x4E45;&#x6027;&#xFF08;Durability&#xFF09;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x5BF9;&#x4E8B;&#x52A1;&#x6027;&#x8981;&#x6C42;&#x8F83;&#x9AD8;&#x6216;&#x8005;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x590D;&#x6742;&#x6570;&#x636E;&#x67E5;&#x8BE2;&#x7684;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x5145;&#x5206;&#x6EE1;&#x8DB3;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x7684;&#x9AD8;&#x6027;&#x80FD;&#x548C;&#x64CD;&#x4F5C;&#x7A33;&#x5B9A;&#x6027;&#x7684;&#x8981;&#x6C42;&#x3002;&#x5E76;&#x4E14;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5341;&#x5206;&#x5F3A;&#x8C03;&#x6570;&#x636E;&#x7684;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x64CD;&#x4F5C;&#x6709;&#x5F88;&#x597D;&#x7684;&#x652F;&#x6301;&#x3002;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x4E8B;&#x52A1;&#x539F;&#x5B50;&#x6027;&#x7EC6;&#x7C92;&#x5EA6;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x65E6;&#x64CD;&#x4F5C;&#x6709;&#x8BEF;&#x6216;&#x8005;&#x6709;&#x9700;&#x8981;&#xFF0C;&#x53EF;&#x4EE5;&#x9A6C;&#x4E0A;&#x56DE;&#x6EDA;&#x4E8B;&#x52A1;&#x3002;</p>
</li>
<li><p>&#x8BFB;&#x5199;&#x6027;&#x80FD;&#xFF1A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5341;&#x5206;&#x5F3A;&#x8C03;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5E76;&#x4E3A;&#x6B64;&#x964D;&#x4F4E;&#x8BFB;&#x5199;&#x6027;&#x80FD;&#x4ED8;&#x51FA;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x867D;&#x7136;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x548C;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x53EF;&#x9760;&#x6027;&#x5F88;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x4E00;&#x65E6;&#x9762;&#x5BF9;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x5904;&#x7406;&#x7684;&#x65F6;&#x5019;&#x6548;&#x7387;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x5DEE;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x9047;&#x5230;&#x9AD8;&#x5E76;&#x53D1;&#x8BFB;&#x5199;&#x7684;&#x65F6;&#x5019;&#x6027;&#x80FD;&#x5C31;&#x4F1A;&#x4E0B;&#x964D;&#x7684;&#x975E;&#x5E38;&#x5389;&#x5BB3;&#x3002;</p>
</li>
<li><p>&#x6388;&#x6743;&#x65B9;&#x5F0F;&#xFF1A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5E38;&#x89C1;&#x7684;&#x6709; Oracle&#xFF0C;SQLServer&#xFF0C;DB2&#xFF0C;Mysql&#xFF0C;&#x9664;&#x4E86;Mysql&#x5927;&#x591A;&#x6570;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5982;&#x679C;&#x8981;&#x4F7F;&#x7528;&#x90FD;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x4E00;&#x7B14;&#x4EF7;&#x683C;&#x9AD8;&#x6602;&#x7684;&#x8D39;&#x7528;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x514D;&#x8D39;&#x7684;Mysql&#x6027;&#x80FD;&#x4E5F;&#x53D7;&#x5230;&#x4E86;&#x8BF8;&#x591A;&#x7684;&#x9650;&#x5236;&#x3002;</p>
</li>
</ul>
<h4 id="523-&#x6570;&#x636E;&#x5E93;&#x7684;&#x8303;&#x5F0F;&#x7406;&#x8BBA;">5.2.3 &#x6570;&#x636E;&#x5E93;&#x7684;&#x8303;&#x5F0F;&#x7406;&#x8BBA;</h4>
<p>&#x6784;&#x9020;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x9075;&#x5FAA;&#x4E00;&#x5B9A;&#x7684;&#x89C4;&#x5219;&#x3002;&#x5728;<a href="https://baike.baidu.com/item/&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;/1237340" target="_blank">&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;</a>&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x89C4;&#x5219;&#x5C31;&#x662F;&#x8303;&#x5F0F;&#x3002;&#x8303;&#x5F0F;&#x662F;&#x7B26;&#x5408;&#x67D0;&#x4E00;&#x79CD;&#x7EA7;&#x522B;&#x7684;<a href="https://baike.baidu.com/item/&#x5173;&#x7CFB;&#x6A21;&#x5F0F;/1237324" target="_blank">&#x5173;&#x7CFB;&#x6A21;&#x5F0F;</a>&#x7684;&#x96C6;&#x5408;&#x3002;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5173;&#x7CFB;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x4E00;&#x5B9A;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5373;&#x6EE1;&#x8DB3;&#x4E0D;&#x540C;&#x7684;&#x8303;&#x5F0F;&#x3002;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x6709;&#x516D;&#x79CD;&#x8303;&#x5F0F;&#xFF1A;<a href="https://baike.baidu.com/item/&#x7B2C;&#x4E00;&#x8303;&#x5F0F;/3193590" target="_blank">&#x7B2C;&#x4E00;&#x8303;&#x5F0F;</a>&#xFF08;<a href="https://baike.baidu.com/item/1NF/1196928" target="_blank">1NF</a>&#xFF09;&#x3001;<a href="https://baike.baidu.com/item/&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;/3193760" target="_blank">&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;</a>&#xFF08;2NF&#xFF09;&#x3001;<a href="https://baike.baidu.com/item/&#x7B2C;&#x4E09;&#x8303;&#x5F0F;/3193798" target="_blank">&#x7B2C;&#x4E09;&#x8303;&#x5F0F;</a>&#xFF08;3NF&#xFF09;&#x3001;<a href="https://baike.baidu.com/item/&#x7B2C;&#x56DB;&#x8303;&#x5F0F;/3193985" target="_blank">&#x7B2C;&#x56DB;&#x8303;&#x5F0F;</a>&#xFF08;4NF&#xFF09;&#x3001;<a href="https://baike.baidu.com/item/&#x7B2C;&#x4E94;&#x8303;&#x5F0F;/5025271" target="_blank">&#x7B2C;&#x4E94;&#x8303;&#x5F0F;</a>&#xFF08;5NF&#xFF09;&#x548C;&#x7B2C;&#x516D;&#x8303;&#x5F0F;&#xFF08;6NF&#xFF09;&#x3002;&#x6EE1;&#x8DB3;&#x6700;&#x4F4E;&#x8981;&#x6C42;&#x7684;&#x8303;&#x5F0F;&#x662F;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#xFF08;1NF&#xFF09;&#x3002;&#x5728;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x4E00;&#x6B65;&#x6EE1;&#x8DB3;&#x66F4;&#x591A;&#x8981;&#x6C42;&#x7684;&#x79F0;&#x4E3A;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#xFF08;2NF&#xFF09;&#xFF0C;&#x5176;&#x4F59;&#x8303;&#x5F0F;&#x4EE5;&#x6B21;&#x7C7B;&#x63A8;&#x3002;&#x4E00;&#x822C;&#x8BF4;&#x6765;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x9700;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#xFF08;3NF&#xFF09;&#x5C31;&#x884C;&#x4E86;&#x3002;</p>
<ul>
<li>&#x5019;&#x9009;&#x952E;&#xFF1A;&#x53EF;&#x4EE5;&#x552F;&#x4E00;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x5143;&#x7EC4;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x8054;&#x5408;&#x5C5E;&#x6027;&#xFF0C;&#x5019;&#x9009;&#x7801;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x3002;</li>
<li>&#x4E3B;&#x952E;&#xFF1A;&#x4E3B;&#x952E;&#x662F;&#x4EBA;&#x4E3A;&#x89C4;&#x5B9A;&#x7684;&#xFF0C;&#x4ECE;&#x5019;&#x9009;&#x7801;&#x4E2D;&#x9009;&#x7684;&#x4E00;&#x4E2A;&#x3002;</li>
<li>&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#xFF1A;&#x4E0D;&#x662F;&#x4E3B;&#x5C5E;&#x6027;&#x7684;&#x5C5E;&#x6027;&#x90FD;&#x662F;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x3002;</li>
<li>&#x4E3B;&#x5173;&#x7CFB;&#x952E;&#xFF1A;&#x5019;&#x9009;&#x952E;</li>
<li>&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#xFF1A;
  &#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x662F;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;&#x4E2D;&#x5C5E;&#x6027;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x79CD;&#x903B;&#x8F91;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;
  &#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x90E8;&#x5206;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x548C;&#x4F20;&#x9012;&#x51FD;&#x6570;&#x4F9D;&#x8D56;</li>
<li>&#x90E8;&#x5206;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#xFF1A;
  &#x5728;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;R&#x4E2D;&#xFF0C;X&#x548C;Y&#x662F;R&#x5173;&#x7CFB;&#x7684;&#x5B50;&#x96C6;&#xFF0C;X&#x7684;&#x771F;&#x5B50;&#x96C6;X&#x2019;,&#x6709;X&#x2019;-&gt;Y,&#x5219;&#x79F0;Y&#x5BF9;X&#x90E8;&#x5206;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x3002;&#x90E8;&#x5206;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x662F;&#x591A;&#x503C;&#x51FD;&#x6570;&#x4F9D;&#x8D56;</li>
<li>&#x4F20;&#x9012;&#x51FD;&#x6570;&#x4F9D;&#x8D56;
  &#x5728;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;R&#x4E2D;&#xFF0C;X,Y,Z&#x662F;U&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x82E5;X-&gt;Y,Y-/-&gt;X,Y-&gt;Z,&#x5219;&#x6709;Z&#x5BF9;X&#x4F20;&#x9012;&#x51FD;&#x6570;&#x4F9D;&#x8D56;</li>
</ul>
<blockquote>
<h6 id="&#x7B2C;&#x4E00;&#x8303;&#x5F0F;">&#x7B2C;&#x4E00;&#x8303;&#x5F0F;</h6>
</blockquote>
<p>&#x7B2C;&#x4E00;&#x8303;&#x5F0F;(1NF)&#xFF1A;&#x6BCF;&#x4E00;&#x5217;&#x8981;&#x4FDD;&#x6301;&#x539F;&#x5B50;&#x7279;&#x5F81; &#x5217;&#x662F;&#x57FA;&#x672C;&#x6570;&#x636E;&#x9879;&#xFF0C;&#x4E0D;&#x80FD;&#x518D;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#xFF0C;&#x5426;&#x5219;&#x8BBE;&#x8BA1;&#x6210;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;
&#x4E0D;&#x6EE1;&#x8DB3;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x5C31;&#x4E0D;&#x80FD;&#x79F0;&#x4E4B;&#x4E3A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<blockquote>
<h6 id="&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;">&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;</h6>
</blockquote>
<p>&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#xFF08;2NF&#xFF09;&#xFF1A;&#x6BCF;&#x4E2A;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x90FD;&#x5B8C;&#x5168;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x4E8E;R&#x7684;&#x4E3B;&#x5173;&#x7CFB;&#x952E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x7B2C;&#x4E00;&#x8303;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6D88;&#x9664;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5BF9;&#x4E3B;&#x5173;&#x7CFB;&#x952E;&#x7684;&#x90E8;&#x5206;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#x3002;</p>
<blockquote>
<h6 id="&#x7B2C;&#x4E09;&#x8303;&#x5F0F;">&#x7B2C;&#x4E09;&#x8303;&#x5F0F;</h6>
</blockquote>
<p>&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#xFF08;3NF&#xFF09;&#xFF1A;&#x6BCF;&#x4E2A;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x90FD;&#x4E0D;&#x4F20;&#x9012;&#x51FD;&#x6570;&#x4F9D;&#x8D56;R&#x7684;&#x4E3B;&#x5173;&#x7CFB;&#x952E;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x7B2C;&#x4E8C;&#x8303;&#x5F0F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6D88;&#x9664;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5BF9;&#x4E3B;&#x5173;&#x7CFB;&#x952E;&#x7684;&#x4F20;&#x9012;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x3002;</p>
<blockquote>
<h6 id="bc&#x8303;&#x5F0F;">BC&#x8303;&#x5F0F;</h6>
</blockquote>
<p>BC&#x8303;&#x5F0F;&#xFF08;BCNF&#xFF09;&#xFF1A;&#x6D88;&#x9664;&#x4E3B;&#x5C5E;&#x6027;&#x6216;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5BF9;&#x4E3B;&#x5173;&#x7CFB;&#x952E;&#x7684;&#x90E8;&#x5206;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x548C;&#x4F20;&#x9012;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#x3002;&#x4ED4;&#x7EC6;&#x5206;&#x6790;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x6392;&#x9664;&#x5F88;&#x591A;&#x65E0;&#x5173;&#x56E0;&#x7D20;&#xFF0C;&#x56E0;&#x4E3A;&#x8981;&#x8FBE;&#x5230;BC&#x8303;&#x5F0F;&#xFF0C;&#x8FD9;&#x65F6;&#x5173;&#x7CFB;&#x80AF;&#x5B9A;&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;&#x4E86;&#x7B2C;&#x4E09;&#x8303;&#x5F0F;&#xFF1A;&#x5DF2;&#x7ECF;&#x6D88;&#x9664;&#x4E86;&#x975E;&#x4E3B;&#x5C5E;&#x6027;&#x5BF9;&#x4E3B;&#x5173;&#x7CFB;&#x952E;&#x7684;&#x90E8;&#x5206;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x548C;&#x4F20;&#x9012;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x3002;&#x4E00;&#x822C;&#x4E3B;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x4E3B;&#x5C5E;&#x6027;&#x5BF9;&#x4E3B;&#x5173;&#x7CFB;&#x952E;&#x7684;&#x90E8;&#x5206;&#x51FD;&#x6570;&#x4F9D;&#x8D56;&#x3002;</p>
<h3 id="53-&#x4E8B;&#x52A1;&#x4E0E;&#x9501;">5.3 &#x4E8B;&#x52A1;&#x4E0E;&#x9501;</h3>
<h4 id="531-&#x4E8B;&#x52A1;&#x7684;&#x7279;&#x6027;acid">5.3.1 &#x4E8B;&#x52A1;&#x7684;&#x7279;&#x6027;ACID</h4>
<ul>
<li><strong>&#x539F;&#x5B50;&#x6027;(Atomic)</strong>&#xFF1A;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x662F;&#x539F;&#x5B50;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#xFF1B;&#x5BF9;&#x4E8E;&#x5176;&#x6570;&#x636E;&#x4FEE;&#x6539;&#xFF0C;&#x8981;&#x4E48;&#x5168;&#x90FD;&#x6267;&#x884C;&#xFF0C;&#x8981;&#x4E48;&#x5168;&#x90FD;&#x4E0D;&#x6267;&#x884C;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x4E0E;&#x67D0;&#x4E2A;&#x4E8B;&#x52A1;&#x5173;&#x8054;&#x7684;&#x64CD;&#x4F5C;&#x5177;&#x6709;&#x5171;&#x540C;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x7684;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x53EA;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x7834;&#x574F;&#x4E8B;&#x52A1;&#x7684;&#x603B;&#x4F53;&#x76EE;&#x6807;&#x3002;&#x539F;&#x5B50;&#x6027;&#x6D88;&#x9664;&#x4E86;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x5B50;&#x96C6;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</li>
<li><strong>&#x4E00;&#x81F4;&#x6027;(Consistency)</strong>&#xFF1A;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x6307;&#x7684;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x548C;&#x6267;&#x884C;&#x4E4B;&#x540E;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x5FC5;&#x987B;&#x5904;&#x4E8E;&#x4E00;&#x81F4;&#x6027;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x79CD;&#x7279;&#x6027;&#x79F0;&#x4E3A;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x5047;&#x5982;&#x6570;&#x636E;&#x5E93;&#x7684;&#x72B6;&#x6001;&#x6EE1;&#x8DB3;&#x6240;&#x6709;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;&#xFF0C;&#x5C31;&#x8BF4;&#x8BE5;&#x6570;&#x636E;&#x5E93;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;</li>
<li><strong>&#x9694;&#x79BB;&#x6027;(Isolation)</strong>&#xFF1A;&#x7531;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x6240;&#x4F5C;&#x7684;&#x4FEE;&#x6539;&#x5FC5;&#x987B;&#x4E0E;&#x4EFB;&#x4F55;&#x5176;&#x5B83;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x6240;&#x4F5C;&#x7684;&#x4FEE;&#x6539;&#x9694;&#x79BB;&#x3002;&#x4E8B;&#x52A1;&#x67E5;&#x770B;&#x6570;&#x636E;&#x65F6;&#x6570;&#x636E;&#x6240;&#x5904;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#x8FD8;&#x662F;&#x4E2D;&#x95F4;&#x67D0;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x7684;&#x8BBE;&#x7F6E;&#x6765;&#x63A7;&#x5236;&#x7684;&#x3002;</li>
<li><strong>&#x6301;&#x4E45;&#x6027;(Durability)</strong>&#xFF1A;&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7684;&#x7ED3;&#x679C;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x56FA;&#x5316;&#xFF0C;&#x5373;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x4E2D;&#x5373;&#x4F7F;&#x673A;&#x5668;&#x5B95;&#x673A;&#x6570;&#x636E;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;&#x5B83;&#x5BF9;&#x4E8E;&#x7CFB;&#x7EDF;&#x7684;&#x5F71;&#x54CD;&#x662F;&#x6C38;&#x4E45;&#x6027;&#x7684;&#x3002;</li>
</ul>
<h4 id="532-&#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x63A7;&#x5236;">5.3.2 &#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x63A7;&#x5236;</h4>
<ul>
<li><strong>&#x7B2C;&#x4E00;&#x7C7B;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF08;Update Lost&#xFF09;</strong>&#xFF1A;&#x6B64;&#x79CD;&#x66F4;&#x65B0;&#x4E22;&#x5931;&#x662F;&#x56E0;&#x4E3A;&#x56DE;&#x6EDA;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x53EB;&#x56DE;&#x6EDA;&#x4E22;&#x5931;&#x3002;&#x6B64;&#x65F6;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x66F4;&#x65B0;count&#xFF0C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x8BFB;&#x53D6;&#x5230;100&#xFF0C;&#x4E8B;&#x52A1;&#x4E00;&#x66F4;&#x65B0;&#x6210;&#x529F;&#x5E76;&#x63D0;&#x4EA4;&#xFF0C;count=100+1=101&#xFF0C;&#x4E8B;&#x52A1;&#x4E8C;&#x51FA;&#x4E8E;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x66F4;&#x65B0;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x56DE;&#x6EDA;&#xFF0C;&#x4E8B;&#x52A1;&#x4E8C;&#x5C31;&#x628A;count&#x8FD8;&#x539F;&#x4E3A;&#x5B83;&#x4E00;&#x5F00;&#x59CB;&#x8BFB;&#x5230;&#x7684;100&#xFF0C;&#x6B64;&#x65F6;&#x4E8B;&#x52A1;&#x4E00;&#x7684;&#x66F4;&#x65B0;&#x5C31;&#x8FD9;&#x6837;&#x4E22;&#x5931;&#x4E86;&#x3002;</li>
<li><strong>&#x810F;&#x8BFB;&#xFF08;Dirty Read&#xFF09;</strong>&#xFF1A;&#x6B64;&#x79CD;&#x5F02;&#x5E38;&#x65F6;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;&#x4E86;&#x4F46;&#x662F;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E8B;&#x52A1;&#x4E00;&#x66F4;&#x65B0;&#x4E86;count=101&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#xFF0C;&#x4E8B;&#x52A1;&#x4E8C;&#x6B64;&#x65F6;&#x8BFB;&#x53D6;count&#xFF0C;&#x503C;&#x4E3A;101&#x800C;&#x4E0D;&#x662F;100&#xFF0C;&#x7136;&#x540E;&#x4E8B;&#x52A1;&#x4E00;&#x51FA;&#x4E8E;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x56DE;&#x6EDA;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x7684;&#x8FD9;&#x4E2A;&#x503C;&#x5C31;&#x662F;&#x5669;&#x68A6;&#x7684;&#x5F00;&#x59CB;&#x3002;</li>
<li><strong>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF08;Not Repeatable Read&#xFF09;</strong>&#xFF1A;&#x6B64;&#x79CD;&#x5F02;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5BF9;&#x540C;&#x4E00;&#x884C;&#x6570;&#x636E;&#x6267;&#x884C;&#x4E86;&#x4E24;&#x6B21;&#x6216;&#x66F4;&#x591A;&#x6B21;&#x67E5;&#x8BE2;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x5F97;&#x5230;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x91CC;&#x9762;&#x4F60;&#x4E0D;&#x80FD;&#x91CD;&#x590D;&#xFF08;&#x5373;&#x591A;&#x6B21;&#xFF09;&#x8BFB;&#x53D6;&#x4E00;&#x884C;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x4E48;&#x505A;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6BCF;&#x6B21;&#x8BFB;&#x53D6;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x4E00;&#x6837;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x9020;&#x6210;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x662F;&#x5728;&#x4E24;&#x6B21;&#x67E5;&#x8BE2;&#x4E4B;&#x95F4;&#x6709;&#x522B;&#x7684;&#x4E8B;&#x52A1;&#x5BF9;&#x8BE5;&#x884C;&#x6570;&#x636E;&#x505A;&#x4E86;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E8B;&#x52A1;&#x4E00;&#x5148;&#x67E5;&#x8BE2;&#x4E86;count&#xFF0C;&#x503C;&#x4E3A;100&#xFF0C;&#x6B64;&#x65F6;&#x4E8B;&#x52A1;&#x4E8C;&#x66F4;&#x65B0;&#x4E86;count=101&#xFF0C;&#x4E8B;&#x52A1;&#x4E00;&#x518D;&#x6B21;&#x8BFB;&#x53D6;count,&#x503C;&#x5C31;&#x4F1A;&#x53D8;&#x6210;101&#xFF0C;&#x4E24;&#x6B21;&#x8BFB;&#x53D6;&#x7ED3;&#x679C;&#x4E0D;&#x4E00;&#x6837;&#x3002;</li>
<li><strong>&#x7B2C;&#x4E8C;&#x7C7B;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF08;Second Update Lost&#xFF09;</strong>&#xFF1A;&#x6B64;&#x79CD;&#x66F4;&#x65B0;&#x4E22;&#x5931;&#x662F;&#x56E0;&#x4E3A;&#x66F4;&#x65B0;&#x88AB;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x7ED9;&#x8986;&#x76D6;&#x4E86;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53EB;&#x8986;&#x76D6;&#x4E22;&#x5931;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x66F4;&#x65B0;count&#xFF0C;&#x90FD;&#x8BFB;&#x53D6;100&#x8FD9;&#x4E2A;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x4E8B;&#x52A1;&#x4E00;&#x5148;&#x66F4;&#x65B0;&#x6210;&#x529F;&#x5E76;&#x63D0;&#x4EA4;&#xFF0C;count=100+1=101&#xFF0C;&#x4E8B;&#x52A1;&#x4E8C;&#x540E;&#x66F4;&#x65B0;&#x6210;&#x529F;&#x5E76;&#x63D0;&#x4EA4;&#xFF0C;count=100+1=101,&#x7531;&#x4E8E;&#x4E8B;&#x52A1;&#x4E8C;count&#x8FD8;&#x662F;&#x4ECE;100&#x5F00;&#x59CB;&#x589E;&#x52A0;&#xFF0C;&#x4E8B;&#x52A1;&#x4E00;&#x7684;&#x66F4;&#x65B0;&#x5C31;&#x8FD9;&#x6837;&#x4E22;&#x5931;&#x4E86;&#x3002;</li>
<li><strong>&#x5E7B;&#x8BFB;&#xFF08;Phantom Read&#xFF09;</strong>&#xFF1A;&#x5E7B;&#x8BFB;&#x548C;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x6709;&#x70B9;&#x50CF;&#xFF0C;&#x53EA;&#x662F;&#x9488;&#x5BF9;&#x7684;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x7684;&#x503C;&#x800C;&#x662F;&#x6570;&#x636E;&#x7684;&#x6570;&#x91CF;&#x3002;&#x6B64;&#x79CD;&#x5F02;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5728;&#x4E24;&#x6B21;&#x67E5;&#x8BE2;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6570;&#x636E;&#x7684;&#x6570;&#x91CF;&#x4E0D;&#x540C;&#xFF0C;&#x8BA9;&#x4EBA;&#x4EE5;&#x4E3A;&#x53D1;&#x751F;&#x5E7B;&#x89C9;&#xFF0C;&#x5E7B;&#x8BFB;&#x5927;&#x6982;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x5F97;&#x6765;&#x7684;&#x5427;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E8B;&#x52A1;&#x4E00;&#x67E5;&#x8BE2;order&#x8868;&#x6709;&#x591A;&#x5C11;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x4E8B;&#x52A1;&#x4E8C;&#x65B0;&#x589E;&#x4E86;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x7136;&#x540E;&#x4E8B;&#x52A1;&#x4E00;&#x67E5;&#x4E86;&#x4E00;&#x4E0B;order&#x8868;&#x6709;&#x591A;&#x5C11;&#x8BB0;&#x5F55;&#xFF0C;&#x53D1;&#x73B0;&#x548C;&#x7B2C;&#x4E00;&#x6B21;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5E7B;&#x8BFB;&#x3002;</li>
</ul>
<h4 id="533-&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;">5.3.3 &#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;</h4>
<ul>
<li><strong>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;&#xFF08;Read Uncommitted&#xFF09;</strong>&#xFF1A;&#x8BE5;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x6307;&#x5373;&#x4F7F;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x66F4;&#x65B0;&#x8BED;&#x53E5;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;,&#x4F46;&#x662F;&#x522B;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x8BFB;&#x5230;&#x8FD9;&#x4E2A;&#x6539;&#x53D8;&#xFF0C;&#x51E0;&#x79CD;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x90FD;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x3002;&#x6781;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x6CA1;&#x6709;&#x5B89;&#x5168;&#x6027;&#x53EF;&#x8A00;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x3002;</li>
<li><strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#xFF08;Read Committed&#xFF09;</strong>&#xFF1A;&#x8BE5;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x6307;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x7684;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x770B;&#x4E0D;&#x5230;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x6D88;&#x9664;&#x4E86;&#x810F;&#x8BFB;&#x548C;&#x7B2C;&#x4E00;&#x7C7B;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF0C;&#x8FD9;&#x662F;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9ED8;&#x8BA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x5982;Oracle,Sqlserver&#x3002;</li>
<li><strong>&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF08;Repeatable Read&#xFF09;</strong>&#xFF1A;&#x8BE5;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x6307;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x8FDB;&#x884C;&#x4E24;&#x6B21;&#x6216;&#x591A;&#x6B21;&#x540C;&#x6837;&#x7684;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5185;&#x5BB9;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x4FDD;&#x8BC1;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x6761;&#x6570;&#x7684;&#x67E5;&#x8BE2;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x5B58;&#x5728;&#x8BFB;&#x6539;&#x884C;&#x6570;&#x636E;&#x5C31;&#x7981;&#x6B62;&#x5199;&#xFF0C;&#x6D88;&#x9664;&#x4E86;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x548C;&#x7B2C;&#x4E8C;&#x7C7B;&#x66F4;&#x65B0;&#x4E22;&#x5931;&#xFF0C;&#x8FD9;&#x662F;Mysql&#x6570;&#x636E;&#x5E93;&#x7684;&#x9ED8;&#x8BA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;</li>
<li><strong>&#x4E32;&#x884C;&#x5316;&#xFF08;Serializable&#xFF09;</strong>&#xFF1A;&#x610F;&#x601D;&#x662F;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x5141;&#x8BB8;&#x522B;&#x7684;&#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x6267;&#x884C;.&#x5B8C;&#x5168;&#x4E32;&#x884C;&#x5316;&#x7684;&#x8BFB;&#xFF0C;&#x53EA;&#x8981;&#x5B58;&#x5728;&#x8BFB;&#x5C31;&#x7981;&#x6B62;&#x5199;,&#x4F46;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8BFB;&#xFF0C;&#x6D88;&#x9664;&#x4E86;&#x5E7B;&#x8BFB;&#x3002;&#x8FD9;&#x662F;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7684;&#x6700;&#x9AD8;&#x7EA7;&#x522B;&#xFF0C;&#x867D;&#x7136;&#x6700;&#x5B89;&#x5168;&#x6700;&#x7701;&#x5FC3;&#xFF0C;&#x4F46;&#x662F;&#x6548;&#x7387;&#x592A;&#x4F4E;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x7528;&#x3002;</li>
</ul>
<table>
<thead>
<tr>
<th style="text-align:left">&#x7EA7;&#x522B;\&#x5F02;&#x5E38;</th>
<th style="text-align:center">&#x7B2C;&#x4E00;&#x7C7B;&#x66F4;&#x65B0;&#x4E22;&#x5931;</th>
<th style="text-align:center">&#x810F;&#x8BFB;</th>
<th style="text-align:center">&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</th>
<th style="text-align:center">&#x7B2C;&#x4E8C;&#x7C7B;&#x4E22;&#x5931;&#x66F4;&#x65B0;</th>
<th style="text-align:center">&#x5E7B;&#x8BFB;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left">&#x8BFB;&#x672A;&#x63D0;&#x4EA4;</td>
<td style="text-align:center">Y</td>
<td style="text-align:center">Y</td>
<td style="text-align:center">Y</td>
<td style="text-align:center">Y</td>
<td style="text-align:center">Y</td>
</tr>
<tr>
<td style="text-align:left">&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</td>
<td style="text-align:center">N</td>
<td style="text-align:center">N</td>
<td style="text-align:center">Y</td>
<td style="text-align:center">Y</td>
<td style="text-align:center">Y</td>
</tr>
<tr>
<td style="text-align:left">&#x53EF;&#x91CD;&#x590D;&#x8BFB;</td>
<td style="text-align:center">N</td>
<td style="text-align:center">N</td>
<td style="text-align:center">N</td>
<td style="text-align:center">N</td>
<td style="text-align:center">Y</td>
</tr>
<tr>
<td style="text-align:left">&#x4E32;&#x884C;&#x5316;</td>
<td style="text-align:center">N</td>
<td style="text-align:center">N</td>
<td style="text-align:center">N</td>
<td style="text-align:center">N</td>
<td style="text-align:center">N</td>
</tr>
</tbody>
</table>
<h4 id="534-&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x9501;">5.3.4 &#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x9501;</h4>
<p>&#x4E00;&#x822C;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x60B2;&#x89C2;&#x9501;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x4E50;&#x89C2;&#x9501;&#xFF0C;&#x60B2;&#x89C2;&#x9501;&#x4E00;&#x822C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x8BF4;&#x7684;&#x6570;&#x636E;&#x5E93;&#x9501;&#x673A;&#x5236;&#xFF0C;&#x4E50;&#x89C2;&#x9501;&#x4E00;&#x822C;&#x662F;&#x6307;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x79CD;&#x9501;&#x673A;&#x5236;&#xFF0C;&#x6BD4;&#x5982;hibernate&#x5B9E;&#x73B0;&#x7684;&#x4E50;&#x89C2;&#x9501;&#x751A;&#x81F3;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E5F;&#x6709;&#x4E50;&#x89C2;&#x9501;&#x7684;&#x601D;&#x60F3;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<blockquote>
<h5 id="&#x60B2;&#x89C2;&#x9501;"><strong>&#x60B2;&#x89C2;&#x9501;</strong></h5>
</blockquote>
<p>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x5F88;&#x60B2;&#x89C2;&#xFF0C;&#x5B83;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x88AB;&#x5916;&#x754C;&#x4FEE;&#x6539;&#x6301;&#x4FDD;&#x5B88;&#x6001;&#x5EA6;&#xFF0C;&#x8BA4;&#x4E3A;&#x6570;&#x636E;&#x968F;&#x65F6;&#x4F1A;&#x4FEE;&#x6539;&#xFF0C;&#x6240;&#x4EE5;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5904;&#x7406;&#x4E2D;&#x9700;&#x8981;&#x5C06;&#x6570;&#x636E;&#x52A0;&#x9501;&#x3002;&#x60B2;&#x89C2;&#x9501;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x4F9D;&#x9760;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x7684;&#x9501;&#x673A;&#x5236;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x884C;&#x9501;&#xFF0C;&#x8868;&#x9501;&#x4E0D;&#x8BBA;&#x662F;&#x8BFB;&#x5199;&#x9501;&#x90FD;&#x662F;&#x60B2;&#x89C2;&#x9501;&#x3002;</p>
<p>&#x60B2;&#x89C2;&#x9501;&#x6309;&#x7167;&#x4F7F;&#x7528;&#x6027;&#x8D28;&#x5212;&#x5206;&#xFF1A;</p>
<ul>
<li><strong>&#x5171;&#x4EAB;&#x9501;&#xFF08;Share locks&#x7B80;&#x8BB0;&#x4E3A;S&#x9501;&#xFF09;</strong>&#xFF1A;&#x4E5F;&#x79F0;&#x8BFB;&#x9501;&#xFF0C;&#x4E8B;&#x52A1;A&#x5BF9;&#x5BF9;&#x8C61;T&#x52A0;s&#x9501;&#xFF0C;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x4E5F;&#x53EA;&#x80FD;&#x5BF9;T&#x52A0;S&#xFF0C;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8BFB;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x6709;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x5230;A&#x91CA;&#x653E;S&#x9501;&#x3002;</li>
<li><strong>&#x6392;&#x5B83;&#x9501;&#xFF08;Exclusivelocks&#x7B80;&#x8BB0;&#x4E3A;X&#x9501;&#xFF09;</strong>&#xFF1A;&#x4E5F;&#x79F0;&#x5199;&#x9501;&#xFF0C;&#x4E8B;&#x52A1;A&#x5BF9;&#x5BF9;&#x8C61;T&#x52A0;X&#x9501;&#x4EE5;&#x540E;&#xFF0C;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x4E0D;&#x80FD;&#x5BF9;T&#x52A0;&#x4EFB;&#x4F55;&#x9501;&#xFF0C;&#x53EA;&#x6709;&#x4E8B;&#x52A1;A&#x53EF;&#x4EE5;&#x8BFB;&#x5199;&#x5BF9;&#x8C61;T&#x76F4;&#x5230;A&#x91CA;&#x653E;X&#x9501;&#x3002;</li>
<li><strong>&#x66F4;&#x65B0;&#x9501;&#xFF08;&#x7B80;&#x8BB0;&#x4E3A;U&#x9501;&#xFF09;</strong>&#xFF1A;&#x7528;&#x6765;&#x9884;&#x5B9A;&#x8981;&#x5BF9;&#x6B64;&#x5BF9;&#x8C61;&#x65BD;&#x52A0;X&#x9501;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x8BFB;&#xFF0C;&#x4F46;&#x4E0D;&#x5141;&#x8BB8;&#x518D;&#x65BD;&#x52A0;U&#x9501;&#x6216;X&#x9501;&#xFF1B;&#x5F53;&#x88AB;&#x8BFB;&#x53D6;&#x7684;&#x5BF9;&#x8C61;&#x5C06;&#x8981;&#x88AB;&#x66F4;&#x65B0;&#x65F6;&#xFF0C;&#x5219;&#x5347;&#x7EA7;&#x4E3A;X&#x9501;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x6765;&#x9632;&#x6B62;&#x6B7B;&#x9501;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x5171;&#x4EAB;&#x9501;&#x65F6;&#xFF0C;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#x5206;&#x4E3A;&#x4E24;&#x6B65;&#xFF0C;&#x9996;&#x5148;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x9501;&#xFF0C;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5171;&#x4EAB;&#x9501;&#x5347;&#x7EA7;&#x4E3A;&#x6392;&#x5B83;&#x9501;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6267;&#x884C;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x6837;&#x5982;&#x679C;&#x540C;&#x65F6;&#x6709;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x5BF9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7533;&#x8BF7;&#x4E86;&#x5171;&#x4EAB;&#x9501;&#xFF0C;&#x5728;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x90FD;&#x8981;&#x5C06;&#x5171;&#x4EAB;&#x9501;&#x5347;&#x7EA7;&#x4E3A;&#x6392;&#x5B83;&#x9501;&#x3002;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x90FD;&#x4E0D;&#x4F1A;&#x91CA;&#x653E;&#x5171;&#x4EAB;&#x9501;&#x800C;&#x662F;&#x4E00;&#x76F4;&#x7B49;&#x5F85;&#x5BF9;&#x65B9;&#x91CA;&#x653E;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x9020;&#x6210;&#x4E86;&#x6B7B;&#x9501;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5728;&#x4FEE;&#x6539;&#x524D;&#x76F4;&#x63A5;&#x7533;&#x8BF7;&#x66F4;&#x65B0;&#x9501;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x4FEE;&#x6539;&#x7684;&#x65F6;&#x5019;&#x518D;&#x5347;&#x7EA7;&#x4E3A;&#x6392;&#x5B83;&#x9501;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x6B7B;&#x9501;&#x3002;</li>
</ul>
<p>&#x60B2;&#x89C2;&#x9501;&#x6309;&#x7167;&#x4F5C;&#x7528;&#x8303;&#x56F4;&#x5212;&#x5206;&#xFF1A;</p>
<ul>
<li><strong>&#x884C;&#x9501;</strong>&#xFF1A;&#x9501;&#x7684;&#x4F5C;&#x7528;&#x8303;&#x56F4;&#x662F;&#x884C;&#x7EA7;&#x522B;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x80FD;&#x591F;&#x786E;&#x5B9A;&#x90A3;&#x4E9B;&#x884C;&#x9700;&#x8981;&#x9501;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x884C;&#x9501;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x77E5;&#x9053;&#x4F1A;&#x5F71;&#x54CD;&#x54EA;&#x4E9B;&#x884C;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x4F7F;&#x7528;&#x8868;&#x9501;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x8868;user&#xFF0C;&#x6709;&#x4E3B;&#x952E;id&#x548C;&#x7528;&#x6237;&#x751F;&#x65E5;birthday&#x5F53;&#x4F60;&#x4F7F;&#x7528;update &#x2026; where id=?&#x8FD9;&#x6837;&#x7684;&#x8BED;&#x53E5;&#x6570;&#x636E;&#x5E93;&#x660E;&#x786E;&#x77E5;&#x9053;&#x4F1A;&#x5F71;&#x54CD;&#x54EA;&#x4E00;&#x884C;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x4F7F;&#x7528;&#x884C;&#x9501;&#xFF0C;&#x5F53;&#x4F60;&#x4F7F;&#x7528;update &#x2026; where birthday=?&#x8FD9;&#x6837;&#x7684;&#x7684;&#x8BED;&#x53E5;&#x7684;&#x65F6;&#x5019;&#x56E0;&#x4E3A;&#x4E8B;&#x5148;&#x4E0D;&#x77E5;&#x9053;&#x4F1A;&#x5F71;&#x54CD;&#x54EA;&#x4E9B;&#x884C;&#x5C31;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;&#x8868;&#x9501;&#x3002;</li>
<li><strong>&#x8868;&#x9501;</strong>&#xFF1A;&#x9501;&#x7684;&#x4F5C;&#x7528;&#x8303;&#x56F4;&#x662F;&#x6574;&#x5F20;&#x8868;&#x3002;</li>
</ul>
<blockquote>
<h5 id="&#x4E50;&#x89C2;&#x9501;"><strong>&#x4E50;&#x89C2;&#x9501;</strong></h5>
</blockquote>
<p>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x5F88;&#x4E50;&#x89C2;&#xFF0C;&#x6BCF;&#x6B21;&#x81EA;&#x5DF1;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#x8BA4;&#x4E3A;&#x6CA1;&#x6709;&#x4EBA;&#x56DE;&#x6765;&#x4FEE;&#x6539;&#x5B83;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x53BB;&#x52A0;&#x9501;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x66F4;&#x65B0;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x53BB;&#x5224;&#x65AD;&#x5728;&#x6B64;&#x671F;&#x95F4;&#x6570;&#x636E;&#x6709;&#x6CA1;&#x6709;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x53BB;&#x5B9E;&#x73B0;&#x3002;&#x65E2;&#x7136;&#x90FD;&#x6709;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x7684;&#x60B2;&#x89C2;&#x9501;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x4F7F;&#x7528;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x4E50;&#x89C2;&#x9501;&#x5462;&#xFF1F;&#x5BF9;&#x4E8E;&#x8BFB;&#x64CD;&#x4F5C;&#x8FDC;&#x591A;&#x4E8E;&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x90FD;&#x662F;&#x8BFB;&#x53D6;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x52A0;&#x9501;&#x4F1A;&#x963B;&#x585E;&#x6240;&#x6709;&#x8BFB;&#x53D6;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x541E;&#x5410;&#x91CF;&#x3002;&#x6700;&#x540E;&#x8FD8;&#x8981;&#x91CA;&#x653E;&#x9501;&#xFF0C;&#x9501;&#x662F;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x5F00;&#x9500;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x60F3;&#x529E;&#x6CD5;&#x89E3;&#x51B3;&#x6781;&#x5C11;&#x91CF;&#x7684;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x7684;&#x540C;&#x6B65;&#x95EE;&#x9898;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x8BFB;&#x5199;&#x6BD4;&#x4F8B;&#x5DEE;&#x8DDD;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x5927;&#x6216;&#x8005;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x4E0D;&#x53CA;&#x65F6;&#xFF0C;&#x541E;&#x5410;&#x91CF;&#x74F6;&#x9888;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x8981;&#x53BB;&#x4F7F;&#x7528;&#x4E50;&#x89C2;&#x9501;&#xFF0C;&#x5B83;&#x589E;&#x52A0;&#x4E86;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x989D;&#x5916;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p>&#x4E50;&#x89C2;&#x9501;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ul>
<li><strong>&#x7248;&#x672C;&#x53F7;&#xFF08;&#x8BB0;&#x4E3A;version&#xFF09;</strong>&#xFF1A;&#x5C31;&#x662F;&#x7ED9;&#x6570;&#x636E;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x6807;&#x8BC6;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x5C31;&#x662F;&#x8868;&#x4E2D;&#x589E;&#x52A0;&#x4E00;&#x4E2A;version&#x5B57;&#x6BB5;&#xFF0C;&#x6BCF;&#x6B21;&#x66F4;&#x65B0;&#x628A;&#x8FD9;&#x4E2A;&#x5B57;&#x6BB5;&#x52A0;1&#xFF0C;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#x628A;version&#x8BFB;&#x51FA;&#x6765;&#xFF0C;&#x66F4;&#x65B0;&#x7684;&#x65F6;&#x5019;&#x6BD4;&#x8F83;version&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x5F00;&#x59CB;&#x8BFB;&#x53D6;&#x7684;version&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x73B0;&#x5728;&#x7684;version&#x6BD4;&#x8001;&#x7684;version&#x5927;&#xFF0C;&#x8BF4;&#x660E;&#x6709;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x66F4;&#x65B0;&#x4E86;&#x8BE5;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x4E86;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x65E0;&#x6CD5;&#x66F4;&#x65B0;&#x7684;&#x901A;&#x77E5;&#xFF0C;&#x7528;&#x6237;&#x81EA;&#x884C;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x901A;&#x77E5;&#x6765;&#x51B3;&#x5B9A;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF0C;&#x6BD4;&#x5982;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x4E00;&#x904D;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x5173;&#x952E;&#x662F;&#x5224;&#x65AD;version&#x548C;&#x66F4;&#x65B0;&#x4E24;&#x4E2A;&#x52A8;&#x4F5C;&#x9700;&#x8981;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x5355;&#x5143;&#x6267;&#x884C;&#xFF0C;&#x5426;&#x5219;&#x5728;&#x4F60;&#x5224;&#x65AD;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x4EE5;&#x540E;&#x6B63;&#x5F0F;&#x66F4;&#x65B0;&#x4E4B;&#x524D;&#x6709;&#x522B;&#x7684;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;&#x4E86;version&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x518D;&#x53BB;&#x66F4;&#x65B0;&#x5C31;&#x53EF;&#x80FD;&#x4F1A;&#x8986;&#x76D6;&#x524D;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x505A;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x9020;&#x6210;&#x7B2C;&#x4E8C;&#x7C7B;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;update &#x2026; where &#x2026; and version=&#x201D;old version&#x201D;&#x8FD9;&#x6837;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x6839;&#x636E;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x662F;0&#x8FD8;&#x662F;&#x975E;0&#x6765;&#x5F97;&#x5230;&#x901A;&#x77E5;&#xFF0C;&#x5982;&#x679C;&#x662F;0&#x8BF4;&#x660E;&#x66F4;&#x65B0;&#x6CA1;&#x6709;&#x6210;&#x529F;&#xFF0C;&#x56E0;&#x4E3A;version&#x88AB;&#x6539;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x8FD4;&#x56DE;&#x975E;0&#x8BF4;&#x660E;&#x66F4;&#x65B0;&#x6210;&#x529F;&#x3002;</li>
<li><strong>&#x65F6;&#x95F4;&#x6233;&#xFF08;timestamp&#xFF09;</strong>&#xFF1A;&#x548C;&#x7248;&#x672C;&#x53F7;&#x57FA;&#x672C;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x662F;&#x901A;&#x8FC7;&#x65F6;&#x95F4;&#x6233;&#x6765;&#x5224;&#x65AD;&#x800C;&#x5DF2;&#xFF0C;&#x6CE8;&#x610F;&#x65F6;&#x95F4;&#x6233;&#x8981;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x4E0D;&#x80FD;&#x662F;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x95F4;&#x3002;</li>
<li><strong>&#x5F85;&#x66F4;&#x65B0;&#x5B57;&#x6BB5;</strong>&#xFF1A;&#x548C;&#x7248;&#x672C;&#x53F7;&#x65B9;&#x5F0F;&#x76F8;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x4E0D;&#x589E;&#x52A0;&#x989D;&#x5916;&#x5B57;&#x6BB5;&#xFF0C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x6709;&#x6548;&#x6570;&#x636E;&#x5B57;&#x6BB5;&#x505A;&#x7248;&#x672C;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x6539;&#x53D8;&#x65E7;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7ED3;&#x6784;&#x3002;&#x5047;&#x8BBE;&#x6709;&#x4E2A;&#x5F85;&#x66F4;&#x65B0;&#x5B57;&#x6BB5;&#x53EB;count,&#x5148;&#x53BB;&#x8BFB;&#x53D6;&#x8FD9;&#x4E2A;count,&#x66F4;&#x65B0;&#x7684;&#x65F6;&#x5019;&#x53BB;&#x6BD4;&#x8F83;&#x6570;&#x636E;&#x5E93;&#x4E2D;count&#x7684;&#x503C;&#x662F;&#x4E0D;&#x662F;&#x6211;&#x671F;&#x671B;&#x7684;&#x503C;&#xFF08;&#x5373;&#x5F00;&#x59CB;&#x8BFB;&#x7684;&#x503C;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5C31;&#x628A;&#x6211;&#x4FEE;&#x6539;&#x7684;count&#x7684;&#x503C;&#x66F4;&#x65B0;&#x5230;&#x8BE5;&#x5B57;&#x6BB5;&#xFF0C;&#x5426;&#x5219;&#x66F4;&#x65B0;&#x5931;&#x8D25;&#x3002;java&#x7684;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x539F;&#x5B50;&#x7C7B;&#x578B;&#x5BF9;&#x8C61;&#x5982;AtomicInteger&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x3002;</li>
<li><strong>&#x6240;&#x6709;&#x5B57;&#x6BB5;</strong>&#xFF1A;&#x548C;&#x5F85;&#x66F4;&#x65B0;&#x5B57;&#x6BB5;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x4F7F;&#x7528;&#x6240;&#x6709;&#x5B57;&#x6BB5;&#x505A;&#x7248;&#x672C;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#xFF0C;&#x53EA;&#x6709;&#x6240;&#x6709;&#x5B57;&#x6BB5;&#x90FD;&#x6CA1;&#x53D8;&#x5316;&#x624D;&#x4F1A;&#x6267;&#x884C;&#x66F4;&#x65B0;</li>
</ul>
<p>&#x4E50;&#x89C2;&#x9501;&#x51E0;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x533A;&#x522B;&#xFF1A;</p>
<p>&#x65B0;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;version&#x65B9;&#x5F0F;&#x548C;timestamp&#x65B9;&#x5F0F;&#xFF0C;&#x9700;&#x8981;&#x589E;&#x52A0;&#x5B57;&#x6BB5;&#xFF0C;&#x5E94;&#x7528;&#x8303;&#x56F4;&#x662F;&#x6574;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x8BBA;&#x90A3;&#x4E2A;&#x5B57;&#x6BB5;&#x4FEE;&#x6539;&#x90FD;&#x4F1A;&#x66F4;&#x65B0;version,&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x66F4;&#x65B0;&#x540C;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x7684;&#x4E24;&#x4E2A;&#x4E0D;&#x76F8;&#x5173;&#x5B57;&#x6BB5;&#x4E5F;&#x662F;&#x4E92;&#x65A5;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x540C;&#x6B65;&#x8FDB;&#x884C;&#x3002;&#x65E7;&#x7CFB;&#x7EDF;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7ED3;&#x6784;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5B57;&#x6BB5;&#x4F5C;&#x4E3A;&#x7248;&#x672C;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x65B0;&#x589E;&#x5B57;&#x6BB5;&#xFF0C;&#x5F85;&#x66F4;&#x65B0;&#x5B57;&#x6BB5;&#x65B9;&#x5F0F;&#x53EA;&#x8981;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;&#x7684;&#x5B57;&#x6BB5;&#x548C;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;&#x7684;&#x5B57;&#x6BB5;&#x6CA1;&#x6709;&#x91CD;&#x53E0;&#x5C31;&#x53EF;&#x4EE5;&#x540C;&#x6B65;&#x8FDB;&#x884C;&#xFF0C;&#x5E76;&#x53D1;&#x6027;&#x66F4;&#x9AD8;&#x3002;</p>
<h3 id="54-&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;">5.4 &#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;</h3>
<h4 id="541-&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7C7B;&#x522B;">5.4.1 &#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7C7B;&#x522B;</h4>
<p>&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x662F;&#x9488;&#x5BF9;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x5E94;&#x7528;&#x9700;&#x6C42;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x4E8E;&#x8BE5;&#x7C7B;&#x5E94;&#x7528;&#xFF0C;&#x5177;&#x6709;&#x6781;&#x9AD8;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4F9D;&#x636E;&#x7ED3;&#x6784;&#x5316;&#x65B9;&#x6CD5;&#x4EE5;&#x53CA;&#x5E94;&#x7528;&#x573A;&#x5408;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x7C7B;&#xFF1A;</p>
<ul>
<li><strong>&#x9762;&#x5411;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x53D1;&#x8BFB;&#x5199;&#x7684;key-value&#x6570;&#x636E;&#x5E93;&#xFF1A;</strong></li>
<li><p>&#x4E3B;&#x8981;&#x7279;&#x70B9;&#x662F;&#x5177;&#x6709;&#x6781;&#x9AD8;&#x7684;&#x5E76;&#x53D1;&#x8BFB;&#x5199;&#x6027;&#x80FD;
   Key-value&#x6570;&#x636E;&#x5E93;&#x662F;&#x4E00;&#x79CD;&#x4EE5;&#x952E;&#x503C;&#x5BF9;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7C7B;&#x4F3C;Java&#x4E2D;&#x7684;map&#x3002;&#x53EF;&#x4EE5;&#x5C06;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x5927;&#x7684;map&#xFF0C;&#x6BCF;&#x4E2A;&#x952E;&#x90FD;&#x4F1A;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x503C;&#x3002;
   <strong>&#x4E3B;&#x6D41;&#x4EE3;&#x8868;</strong>&#xFF1A;Redis&#xFF0C; Amazon DynamoDB&#xFF0C; Memcached&#xFF0C; Microsoft Azure Cosmos DB&#x548C;Hazelcast</p>
</li>
<li><p><strong>&#x9762;&#x5411;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x7684;&#x9762;&#x5411;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#xFF1A;</strong></p>
<p>  &#x4E3B;&#x8981;&#x7279;&#x70B9;&#x662F;&#x5728;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x7684;&#x67E5;&#x8BE2;&#x6570;&#x636E;
   &#x6587;&#x6863;&#x5B58;&#x50A8;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x5185;&#x90E8;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x5904;&#x7406;&#xFF0C;&#x4E3B;&#x8981;&#x662F;JSON&#x3002;JSON&#x6587;&#x6863;&#x4E5F;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x7EAF;&#x6587;&#x672C;&#x5B58;&#x50A8;&#x5728;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x6216;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;
   <strong>&#x4E3B;&#x6D41;&#x4EE3;&#x8868;</strong>&#xFF1A;MongoDB&#xFF0C;Amazon DynamoDB&#xFF0C;Couchbase&#xFF0C; Microsoft Azure Cosmos DB&#xFF0C;CouchDB</p>
</li>
<li><p><strong>&#x9762;&#x5411;&#x641C;&#x7D22;&#x6570;&#x636E;&#x5185;&#x5BB9;&#x7684;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#xFF1A;</strong></p>
</li>
<li><p>&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x662F;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x641C;&#x7D22;&#x6570;&#x636E;&#x5185;&#x5BB9;&#x7684;NoSQL&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x3002;
   &#x4E3B;&#x8981;&#x662F;&#x7528;&#x4E8E;&#x5BF9;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8FD1;&#x5B9E;&#x65F6;&#x7684;&#x5904;&#x7406;&#x548C;&#x5206;&#x6790;&#x5904;&#x7406;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x548C;&#x6570;&#x636E;&#x6316;&#x6398;
   <strong>&#x4E3B;&#x6D41;&#x4EE3;&#x8868;&#xFF1A;Elasticsearch&#xFF0C;Splunk&#xFF0C;Solr&#xFF0C;MarkLogic&#xFF0C;Sphinx</strong></p>
</li>
<li><p><strong>&#x9762;&#x5411;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#xFF1A;</strong></p>
<p>  &#x4E3B;&#x8981;&#x7279;&#x70B9;&#x662F;&#x5177;&#x6709;&#x5F88;&#x5F3A;&#x7684;&#x53EF;&#x62D3;&#x5C55;&#x6027;
  &#x666E;&#x901A;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x662F;&#x4EE5;&#x884C;&#x4E3A;&#x5355;&#x4F4D;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x64C5;&#x957F;&#x4EE5;&#x884C;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x8BFB;&#x5165;&#x5904;&#x7406;&#xFF0C;&#x6BD4;&#x5982;&#x7279;&#x5B9A;&#x6761;&#x4EF6;&#x6570;&#x636E;&#x7684;&#x83B7;&#x53D6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x88AB;&#x6210;&#x4E3A;&#x9762;&#x5411;&#x884C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x9762;&#x5411;&#x5217;&#x7684;&#x6570;&#x636E;&#x5E93;&#x662F;&#x4EE5;&#x5217;&#x4E3A;&#x5355;&#x4F4D;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x64C5;&#x957F;&#x4EE5;&#x5217;&#x4E3A;&#x5355;&#x4F4D;&#x8BFB;&#x5165;&#x6570;&#x636E;&#x3002;
   &#x8BE5;&#x7C7B;&#x6570;&#x636E;&#x5E93;&#x60F3;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x5728;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x4E0A;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x9002;&#x5E94;&#x6570;&#x636E;&#x91CF;&#x7684;&#x589E;&#x52A0;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x8BB0;&#x5F55;&#x4E2D;&#xFF0C;&#x80FD;&#x591F;&#x5BB9;&#x7EB3;&#x5927;&#x91CF;&#x52A8;&#x6001;&#x5217;&#x3002;&#x7531;&#x4E8E;&#x5217;&#x540D;&#x548C;&#x8BB0;&#x5F55;&#x952E;&#x4E0D;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x8BB0;&#x5F55;&#x53EF;&#x80FD;&#x6709;&#x6570;&#x5341;&#x4EBF;&#x5217;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x5B58;&#x50A8;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x4E8C;&#x7EF4;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x3002;
   <strong>&#x4E3B;&#x6D41;&#x4EE3;&#x8868;&#xFF1A;Cassandra&#xFF0C;HBase&#xFF0C;Microsoft Azure Cosmos DB&#xFF0C; Datastax Enterprise&#xFF0C;Accumulo</strong></p>
</li>
</ul>
<h4 id="542-cap&#x7406;&#x8BBA;">5.4.2 CAP&#x7406;&#x8BBA;</h4>
<p>NoSQL&#x7684;&#x57FA;&#x672C;&#x9700;&#x6C42;&#x5C31;&#x662F;&#x652F;&#x6301;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x4E25;&#x683C;&#x4E00;&#x81F4;&#x6027;&#x4E0E;&#x53EF;&#x7528;&#x6027;&#x9700;&#x8981;&#x4E92;&#x76F8;&#x53D6;&#x820D;</p>
<p> CAP&#x7406;&#x8BBA;&#xFF1A;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;<strong>C(&#x4E00;&#x81F4;&#x6027;)</strong>&#x3001;<strong>A(&#x53EF;&#x7528;&#x6027;)</strong>&#x3001;<strong>P(&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;)</strong>&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x9700;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x6EE1;&#x8DB3;&#x5176;&#x4E2D;&#x7684;&#x4E24;&#x9879;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x5206;&#x533A;&#x5BB9;&#x9519;&#x662F;&#x57FA;&#x672C;&#x9700;&#x6C42;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x80FD;&#x79F0;&#x4E4B;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5728;C&#x548C;A&#x4E4B;&#x95F4;&#x5BFB;&#x6C42;&#x5E73;&#x8861;&#x3002;</p>
<p> C(Consistency)&#x4E00;&#x81F4;&#x6027; &#x4E00;&#x81F4;&#x6027;&#x662F;&#x6307;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#x5E76;&#x8FD4;&#x56DE;&#x5BA2;&#x6237;&#x7AEF;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x7684;&#x6570;&#x636E;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x3002;&#x4E0E;ACID&#x7684;C&#x5B8C;&#x5168;&#x4E0D;&#x540C; A(Availability)&#x53EF;&#x7528;&#x6027; &#x53EF;&#x7528;&#x6027;&#x662F;&#x6307;&#x670D;&#x52A1;&#x4E00;&#x76F4;&#x53EF;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x6B63;&#x5E38;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3002; P(Partition tolerance)&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027; &#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;&#x662F;&#x6307;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x5728;&#x9047;&#x5230;&#x67D0;&#x8282;&#x70B9;&#x6216;&#x7F51;&#x7EDC;&#x5206;&#x533A;&#x6545;&#x969C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ECD;&#x7136;&#x80FD;&#x591F;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x6EE1;&#x8DB3;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x53EF;&#x7528;&#x6027;&#x7684;&#x670D;&#x52A1;&#x3002;**</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> &#xA9; All Rights Reserved </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> updated 2020-02-19 04:16:47 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../chapter04/" class="navigation navigation-prev " aria-label="Previous page: chapter 04 SQL函数">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../chapter06/" class="navigation navigation-next " aria-label="Next page: chapter 06 JDBC三层架构">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"chapter 05 数据库基础理论","level":"1.6","depth":1,"next":{"title":"chapter 06 JDBC三层架构","level":"1.7","depth":1,"path":"chapter06/README.md","ref":"./chapter06/README.md","articles":[]},"previous":{"title":"chapter 04 SQL函数","level":"1.5","depth":1,"path":"chapter04/README.md","ref":"./chapter04/README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","code","page-footer-ex","-sharing","sharing-plus","theme-comscore","prism","-highlight"],"styles":{"website":"styles/vue.css"},"pluginsConfig":{"prism":{"css":["prismjs/themes/prism-tomorrow.css"]},"page-footer-ex":{"copyright":"© All Rights Reserved","markdown":false,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"updated"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-comscore":{},"sharing":{"qq":true,"all":["facebook","google","twitter","weibo","qq","linkedin","qzone","douban"],"douban":false,"facebook":false,"weibo":true,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":false,"messenger":false,"line":false,"vk":false,"pocket":false,"google":false,"viber":false,"stumbleupon":false,"qzone":true,"linkedin":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Laglangyue","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"SQL概要与数据库理论","language":"zh-hans","gitbook":"3.2.3","description":"SQL概要与数据库理论"},"file":{"path":"chapter05/README.md","mtime":"2020-02-18T20:16:47.354Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-03-06T16:58:18.452Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

