
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>数据结构理论 · SQL数据结构</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Laglangyue">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-footer-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-tomorrow.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/vue.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../chapter02/JDSChapter02.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="JDSChapter01.html">
            
                <a href="JDSChapter01.html">
            
                    
                    数据结构理论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter02/JDSChapter02.html">
            
                <a href="../chapter02/JDSChapter02.html">
            
                    
                    java基本类型与包装类
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter03/JDSChapter03.html">
            
                <a href="../chapter03/JDSChapter03.html">
            
                    
                    java数据结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../chapter04/JDSChapter04.html">
            
                <a href="../chapter04/JDSChapter04.html">
            
                    
                    java容器类源码分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../chapter05/JDSChapter05.html">
            
                <a href="../chapter05/JDSChapter05.html">
            
                    
                    JUC并发编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../chapter06/JDSChapter06.html">
            
                <a href="../chapter06/JDSChapter06.html">
            
                    
                    java图论实践
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >数据结构理论</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="chapter02-&#x6570;&#x636E;&#x7ED3;&#x6784;&#x57FA;&#x672C;&#x7406;&#x8BBA;">Chapter02. &#x6570;&#x636E;&#x7ED3;&#x6784;&#x57FA;&#x672C;&#x7406;&#x8BBA;</h2>
<h3 id="21-&#x5F15;&#x8A00;">2.1 &#x5F15;&#x8A00;</h3>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x7B97;&#x6CD5;&#x57FA;&#x7840;&#xFF0C;&#x4E3B;&#x8981;&#x6709;8&#x7C7B;&#xFF0C;&#x672C;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x6BCF;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5F62;&#x5F0F;&#x53CA;&#x5176;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x524D;&#x56DB;&#x79CD;&#x7ED3;&#x6784;&#x8F83;&#x4E3A;&#x7B80;&#x5355;&#xFF0C;&#x540E;&#x56DB;&#x79CD;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#x3002;&#x672C;&#x7AE0;&#x53EA;&#x4F5C;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#xFF0C;&#x4EE5;&#x6982;&#x5FF5;&#x4E3A;&#x4E3B;&#xFF0C;&#x60F3;&#x8981;&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#xFF0C;&#x5EFA;&#x8BAE;&#x7ED3;&#x5408;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x6BCF;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<ul>
<li>&#x6570;&#x7EC4;</li>
<li>&#x6808;</li>
<li>&#x961F;&#x5217;</li>
<li>&#x94FE;&#x8868;</li>
<li>&#x6811;</li>
<li>&#x6563;&#x5217;&#x8868;</li>
<li>&#x5806;</li>
<li>&#x56FE;</li>
</ul>
<p><img src="DS.jpg" alt="u=2342770679,2195164754&amp;fm=26&amp;gp=0"></p>
<h3 id="22-&#x6570;&#x7EC4;">2.2 &#x6570;&#x7EC4;</h3>
<p>&#x6570;&#x7EC4;&#x662F;&#x5185;&#x5B58;&#x4E2D;&#x8FDE;&#x7EED;&#x5B58;&#x50A8;&#x591A;&#x4E2A;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5143;&#x7D20;&#x7684;&#x7EBF;&#x6027;&#x7ED3;&#x6784;&#xFF0C;&#x5728;&#x5185;&#x5B58;&#x5206;&#x914D;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#x3002;&#x4E00;&#x822C;&#x5728;&#x58F0;&#x660E;&#x65F6;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x957F;&#x5EA6;&#xFF0C;&#x5176;&#x4E0B;&#x6807;&#x5C31;&#x662F;&#x7D22;&#x5F15;&#x3002;</p>
<blockquote>
<p>&#x7279;&#x70B9;(&#x4F18;&#x70B9;)&#xFF1A;</p>
<ul>
<li>&#x4F9D;&#x636E;&#x4E0B;&#x6807;&#x7D22;&#x5F15;&#x63D2;&#x53D9;&#x901F;&#x5EA6;&#x5FEB;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x4E0B;&#x6807;&#x7D22;&#x5F15;&#x904D;&#x5386;&#x6570;&#x7EC4;&#x3002;</li>
</ul>
<p>&#x7F3A;&#x70B9;&#xFF1A;</p>
<ul>
<li><p>&#x6570;&#x7EC4;&#x5927;&#x5C0F;&#x56FA;&#x5B9A;&#xFF0C;&#x65E0;&#x6CD5;&#x6269;&#x5BB9;</p>
</li>
<li><p>&#x6570;&#x7EC4;&#x53EA;&#x80FD;&#x5B58;&#x50A8;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x6570;&#x636E;</p>
</li>
<li>&#x7531;&#x4E8E;&#x6570;&#x7EC4;&#x56FA;&#x5B9A;&#x987A;&#x5E8F;&#xFF0C;insert&#x548C;delete&#x64CD;&#x4F5C;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#xFF0C;&#x5BFC;&#x81F4;&#x64CD;&#x4F5C;&#x901F;&#x5EA6;&#x6162;</li>
</ul>
<p>&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF1A;&#x9891;&#x7E41;&#x67E5;&#x8BE2;&#xFF0C;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x8981;&#x6C42;&#x4E0D;&#x5927;&#xFF0C;&#x5982;&#x6570;&#x5B66;&#x4E0A;&#x7684;&#x4E00;&#x7EF4;&#x5411;&#x91CF;&#xFF0C;&#x4E8C;&#x7EF4;&#x77E9;&#x9635;&#x4E00;&#x822C;&#x91C7;&#x7528;&#x6570;&#x7EC4;&#x5B58;&#x50A8;&#x3002;</p>
</blockquote>
<p>&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#xFF1A;sort()&#xFF0C;length()</p>
<h3 id="23-&#x6808;stack">2.3 &#x6808;(Stack)</h3>
<p>&#x6808;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x7EBF;&#x6027;&#x8868;&#xFF0C;&#x4E5F;&#x662F;&#x987A;&#x5E8F;&#x7ED3;&#x6784;&#xFF0C;&#x4EC5;&#x80FD;&#x5728;&#x7EBF;&#x6027;&#x8868;&#x64CD;&#x4F5C;&#xFF0C;&#x6808;&#x9876;&#x5141;&#x8BB8;&#x64CD;&#x4F5C;&#xFF0C;&#x6808;&#x5E95;&#x4E0D;&#x5141;&#x8BB8;&#x64CD;&#x4F5C;&#xFF0C;&#x5176;&#x7279;&#x70B9;&#x5728;&#x4E8E;&#x5148;&#x8FDB;&#x540E;&#x51FA;LIFO&#xFF0C;&#x540E;&#x8FDB;&#x5148;&#x51FA;&#x3002;&#x4ECE;&#x6808;&#x9876;put&#x5143;&#x7D20;&#x53EB;&#x505A;&#x5165;&#x6808;&#xFF0C;&#x53D6;&#x51FA;&#x5143;&#x7D20;&#x53EB;&#x505A;&#x51FA;&#x6808;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF1A;&#x6808;&#x7ED3;&#x6784;&#x9002;&#x5408;&#x4F7F;&#x7528;&#x5728;&#x9012;&#x5F52;&#x573A;&#x666F;&#xFF0C;&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#x5217;&#xFF0C;&#x6570;&#x5236;&#x8F6C;&#x5316;&#x6C42;&#x4F59;&#x6CD5;&#x3002;</p>
<p>&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#xFF1A;push(),pop(),peek(),search()</p>
<h3 id="24-&#x961F;&#x5217;">2.4 &#x961F;&#x5217;</h3>
<p>&#x961F;&#x5217;&#x4E0E;&#x6808;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E5F;&#x662F;&#x987A;&#x5E8F;&#x7EBF;&#x6027;&#x8868;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x961F;&#x5217;&#x53EF;&#x4EE5;&#x5728;&#x4E24;&#x7AEF;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF0C;FIFO&#x3002;&#x5728;&#x5C3E;&#x7AEF;&#x6DFB;&#x52A0;&#x5143;&#x7D20;&#x79F0;&#x4E3A;&#x5165;&#x961F;&#xFF0C;&#x4ECE;&#x9996;&#x7AEF;&#x53D6;&#x51FA;&#x6570;&#x636E;&#x79F0;&#x4E3A;&#x51FA;&#x961F;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF1A;&#x961F;&#x5217;&#x7684;&#x7279;&#x70B9;&#x5728;&#x4E8E;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF0C;&#x5E38;&#x7528;&#x4E8E;&#x591A;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x961F;&#x5217;&#x7BA1;&#x7406;&#x3002;</p>
<h3 id="25-&#x94FE;&#x8868;">2.5 &#x94FE;&#x8868;</h3>
<p>&#x94FE;&#x8868;&#x5728;&#x7269;&#x7406;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x662F;&#x975E;&#x8FDE;&#x7EED;&#xFF0C;&#x975E;&#x987A;&#x5E8F;&#x7684;&#x3002;&#x6570;&#x636E;&#x5143;&#x7D20;&#x901A;&#x8FC7;&#x94FE;&#x8868;&#x7684;&#x6307;&#x9488;&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x6709;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x672C;&#x5143;&#x7D20;&#x6570;&#x636E;&#x57DF;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x6307;&#x9488;(&#x672C;&#x5143;&#x7D20;&#x7684;&#x6307;&#x9488;&#x57DF;)&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x4E2A;&#x7ED3;&#x70B9;&#x7684;&#x6307;&#x9488;&#x57DF;&#x3002;</p>
<p>&#x6839;&#x636E;&#x6307;&#x9488;&#x7684;&#x6307;&#x5411;&#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x5355;&#x5411;&#x94FE;&#x8868;&#xFF0C;&#x53CC;&#x5411;&#x94FE;&#x8868;&#xFF0C;&#x53CC;&#x5411;&#x94FE;&#x8868;&#x3002;</p>
<blockquote>
<p>&#x4F18;&#x70B9;&#xFF1A;</p>
<ul>
<li><p>&#x94FE;&#x8868;&#x4E0D;&#x9700;&#x8981;&#x521D;&#x59CB;&#x5316;&#x5BB9;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x52A0;&#x51CF;&#x5143;&#x7D20;</p>
</li>
<li><p>&#x6DFB;&#x52A0;&#x5220;&#x9664;&#x5143;&#x7D20;&#x53EA;&#x9700;&#x8981;&#x6539;&#x53D8;&#x524D;&#x540E;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x7ED3;&#x70B9;&#x7684;&#x6307;&#x9488;&#x57DF;&#x6307;&#x5411;&#xFF0C;&#x6DFB;&#x52A0;&#x548C;&#x5220;&#x9664;&#x5341;&#x5206;&#x65B9;&#x4FBF;</p>
</li>
</ul>
<p>&#x7F3A;&#x70B9;:</p>
<ul>
<li><p>&#x94FE;&#x8868;&#x6CA1;&#x6709;&#x7D22;&#x5F15;&#xFF0C;&#x6BCF;&#x6B21;&#x67E5;&#x8BE2;&#x90FD;&#x9700;&#x8981;&#x904D;&#x5386;&#xFF0C;&#x67E5;&#x8BE2;&#x8017;&#x65F6;</p>
</li>
<li><p>&#x542B;&#x6709;&#x5927;&#x91CF;&#x6307;&#x9488;&#x57DF;&#xFF0C;&#x5360;&#x7528;&#x7A7A;&#x95F4;&#x8F83;&#x5927;</p>
</li>
</ul>
</blockquote>
<p>&#x9002;&#x7528;&#x573A;&#x666F;&#xFF1A;&#x6570;&#x636E;&#x91CF;&#x5C0F;&#xFF0C;&#x9891;&#x7E41;&#x589E;&#x52A0;&#x548C;&#x5220;&#x9664;&#x573A;&#x666F;</p>
<h3 id="26-&#x6811;">2.6 &#x6811;</h3>
<p>&#x6570;&#x662F;&#x4E00;&#x79CD;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#xFF0C;&#x6839;&#x5728;&#x4E0A;&#xFF0C;&#x53F6;&#x5728;&#x4E0B;&#x3002;&#x6BCF;&#x4E00;&#x6761;&#x652F;&#x8DEF;&#x662F;&#x4E00;&#x4E2A;&#x94FE;&#x8868;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x591A;&#x4E2A;&#x94FE;&#x8868;&#x7684;&#x4EA4;&#x53C9;&#x7F51;&#x7EDC;&#x3002;&#x5B9A;&#x4E49;&#x4E3A;n&#x4E2A;&#x7ED3;&#x70B9;&#x7684;&#x6709;&#x9650;&#x96C6;&#x5408;&#xFF0C;n&gt;0&#x3002;</p>
<p>&#x6570;&#x5206;&#x4E3A;&#x4E8C;&#x53C9;&#x6811;&#x548C;&#x591A;&#x53C9;&#x6811;&#xFF0C;&#x4E8C;&#x53C9;&#x6811;&#x8F83;&#x4E3A;&#x5E38;&#x7528;&#xFF0C;&#x591A;&#x53C9;&#x6811;&#x672C;&#x8D28;&#x4E0A;&#x4E0E;&#x4E8C;&#x53C9;&#x6811;&#x4E00;&#x81F4;&#xFF0C;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x6709;0&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x5B50;&#x8282;&#x70B9;</li>
<li>&#x6CA1;&#x6709;&#x7236;&#x8282;&#x70B9;&#x7684;&#x7ED3;&#x70B9;&#x79F0;&#x4E3A;&#x6839;&#x7ED3;&#x70B9;&#xFF0C;&#x4E00;&#x68F5;&#x6811;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6839;&#x7ED3;&#x70B9;</li>
<li>&#x6BCF;&#x4E2A;&#x975E;&#x6839;&#x7ED3;&#x70B9;&#x6709;&#x4E14;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7236;&#x8282;&#x70B9;</li>
<li>&#x9664;&#x4E86;&#x6839;&#x8282;&#x70B9;&#x5916;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x4E0D;&#x76F8;&#x4EA4;&#x7684;&#x5B50;&#x6811;</li>
</ul>
<p><strong>&#x7ED3;&#x70B9;&#x5206;&#x7C7B;</strong></p>
<blockquote>
<ul>
<li><p>&#x7ED3;&#x70B9;&#x62E5;&#x6709;&#x7684;&#x5B50;&#x6811;&#x6570;&#x79F0;&#x4E3A;&#x7ED3;&#x70B9;&#x7684;&#x5EA6;&#xFF08;Degree&#xFF09;&#x3002;</p>
</li>
<li><p>&#x5EA6;&#x4E3A;0&#x7684;&#x7ED3;&#x70B9;&#x79F0;&#x4E3A;&#x53F6;&#x7ED3;&#x70B9;&#xFF08;Leaf&#xFF09;&#x6216;&#x7EC8;&#x7AEF;&#x7ED3;&#x70B9;&#xFF1B;&#x5EA6;&#x4E0D;&#x4E3A;0&#x7684;&#x7ED3;&#x70B9;&#x79F0;&#x4E3A;&#x975E;&#x7EC8;&#x7AEF;&#x7ED3;&#x70B9;&#x6216;&#x5206;&#x652F;&#x7ED3;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x9664;&#x6839;&#x8282;&#x70B9;&#x4E4B;&#x5916;&#xFF0C;&#x5206;&#x652F;&#x7ED3;&#x70B9;&#x4E5F;&#x79F0;&#x4E3A;&#x5185;&#x90E8;&#x7ED3;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x6811;&#x7684;&#x5EA6;&#x662F;&#x6811;&#x5185;&#x7ED3;&#x70B9;&#x7684;&#x5EA6;&#x7684;&#x6700;&#x5927;&#x503C;</p>
</li>
</ul>
</blockquote>
<p><strong>&#x7ED3;&#x70B9;&#x5173;&#x7CFB;</strong></p>
<blockquote>
<ul>
<li><p>&#x7ED3;&#x70B9;&#x7684;&#x5B50;&#x6811;&#x7684;&#x6839;&#x79F0;&#x4E3A;&#x8BE5;&#x8282;&#x70B9;&#x7684;&#x5B69;&#x5B50;&#xFF08;Child&#xFF09;&#xFF0C;&#x76F8;&#x5E94;&#x5730;&#xFF0C;&#x8BE5;&#x7ED3;&#x70B9;&#x79F0;&#x4E3A;&#x5B69;&#x5B50;&#x7684;&#x53CC;&#x4EB2;&#xFF08;Parent&#xFF09;&#x3002;</p>
</li>
<li><p>&#x540C;&#x4E00;&#x4E2A;&#x53CC;&#x4EB2;&#x7684;&#x5B69;&#x5B50;&#x4E4B;&#x95F4;&#x4E92;&#x79F0;&#x5144;&#x5F1F;&#xFF08;Sibling&#xFF09;&#x3002;</p>
</li>
<li><p>&#x7ED3;&#x70B9;&#x7684;&#x7956;&#x5148;&#x662F;&#x4ECE;&#x6839;&#x7ED3;&#x70B9;&#x5230;&#x8BE5;&#x8282;&#x70B9;&#x6240;&#x7ECF;&#x5206;&#x652F;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x7ED3;&#x70B9;&#xFF08;&#x5305;&#x62EC;&#x6839;&#x7ED3;&#x70B9;&#xFF09;&#x3002;</p>
</li>
<li>&#x4EE5;&#x67D0;&#x7ED3;&#x70B9;&#x4E3A;&#x6839;&#x7684;&#x5B50;&#x6811;&#x4E2D;&#x4EFB;&#x4E00;&#x7ED3;&#x70B9;&#x90FD;&#x79F0;&#x4E3A;&#x8BE5;&#x7ED3;&#x70B9;&#x7684;&#x5B50;&#x5B59;&#x3002;</li>
</ul>
</blockquote>
<p><strong>&#x6811;&#x7684;&#x5176;&#x4ED6;&#x76F8;&#x5173;&#x6982;&#x5FF5;&#xFF1A;</strong> </p>
<blockquote>
<ul>
<li><p>&#x7ED3;&#x70B9;&#x7684;&#x5C42;&#x6B21;&#xFF08;Level&#xFF09;&#x4ECE;&#x6839;&#x5F00;&#x59CB;&#x5B9A;&#x4E49;&#x8D77;&#xFF0C;&#x6839;&#x4E3A;&#x7B2C;&#x4E00;&#x5C42;&#xFF0C;&#x6839;&#x7684;&#x5B69;&#x5B50;&#x4E3A;&#x7B2C;&#x4E8C;&#x5C42;&#x3002;</p>
</li>
<li><p>&#x53CC;&#x4EB2;&#x5728;&#x540C;&#x4E00;&#x5C42;&#x7684;&#x7ED3;&#x70B9;&#x4E92;&#x79F0;&#x4E3A;&#x5802;&#x5144;&#x5F1F;&#x3002;</p>
</li>
<li><p>&#x6811;&#x4E2D;&#x7ED3;&#x70B9;&#x7684;&#x6700;&#x5927;&#x5C42;&#x6B21;&#x79F0;&#x4E3A;&#x4E66;&#x7684;&#x6DF1;&#x5EA6;&#xFF08;Depth&#xFF09;&#x6216;&#x9AD8;&#x5EA6;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x5DE6;&#x53F3;&#x5B50;&#x6811;&#x662F;&#x6709;&#x6B21;&#x5E8F;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x4E92;&#x6362;&#x7684;&#xFF0C;&#x5219;&#x79F0;&#x8BE5;&#x6811;&#x4E3A;&#x6709;&#x5E8F;&#x6811;&#xFF0C;&#x5426;&#x5219;&#x79F0;&#x4E3A;&#x65E0;&#x5E8F;&#x6811;&#x3002;</p>
</li>
<li><p>&#x68EE;&#x6797;&#xFF08;Forest&#xFF09;&#x662F;m&#xFF08;m &gt;= 0&#xFF09;&#x8BFE;&#x4E92;&#x4E0D;&#x76F8;&#x4EA4;&#x7684;&#x6811;&#x7684;&#x96C6;&#x5408;&#x3002;</p>
</li>
</ul>
</blockquote>
<p>&#x4E8C;&#x53C9;&#x6811;&#x662F;&#x7279;&#x6B8A;&#x6811;&#xFF0C;&#x4E8C;&#x53C9;&#x6811;&#x5728;&#x6811;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5177;&#x6709;&#x5982;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x6BCF;&#x4E2A;&#x7ED3;&#x70B9;&#x6700;&#x591A;&#x6709;&#x4E24;&#x68F5;&#x5B50;&#x6811;&#xFF0C;&#x7ED3;&#x70B9;&#x5EA6;&#x6700;&#x5927;&#x4E3A;2</li>
<li>&#x5DE6;&#x5B50;&#x6811;&#x548C;&#x53F3;&#x5B50;&#x6811;&#x6709;&#x987A;&#x5E8F;&#xFF0C;&#x6B21;&#x5E8F;&#x4E0D;&#x80FD;&#x98A0;&#x5012;</li>
<li>&#x5373;&#x4F7F;&#x67D0;&#x4E2A;&#x7ED3;&#x70B9;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B50;&#x6811;&#xFF0C;&#x4E5F;&#x8981;&#x533A;&#x5206;&#x5DE6;&#x53F3;&#x5B50;&#x6811;</li>
</ul>
<p>&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x904D;&#x5386;&#xFF0C;&#x4ECE;&#x6839;&#x8282;&#x70B9;&#x4F9D;&#x6B21;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x8282;&#x70B9;</p>
<blockquote>
<ul>
<li><p><strong>&#x524D;&#x5E8F;&#x904D;&#x5386;</strong></p>
<p>   &#x82E5;&#x4E8C;&#x53C9;&#x6811;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x5148;&#x904D;&#x5386;&#x6839;&#x7ED3;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x904D;&#x5386;&#x5DE6;&#x5B50;&#x6811;&#xFF0C;&#x518D;&#x904D;&#x5386;&#x53F3;&#x5B50;&#x6811;&#x3002;</p>
</li>
<li><p><strong>&#x4E2D;&#x5E8F;&#x904D;&#x5386;</strong></p>
<p>   &#x5982;&#x679C;&#x4E8C;&#x53C9;&#x6811;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x4ECE;&#x6839;&#x7ED3;&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x5148;&#x904D;&#x5386;&#x5DE6;&#x5B50;&#x6811;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x6839;&#x7ED3;&#x70B9;&#xFF0C;&#x5DE6;&#x540E;&#x662F;&#x53F3;&#x5B50;&#x6811;&#x3002;</p>
</li>
<li><h6 id="&#x540E;&#x7EED;&#x904D;&#x5386;">&#x540E;&#x7EED;&#x904D;&#x5386;</h6>
<p>   &#x5982;&#x679C;&#x4E8C;&#x53C9;&#x6811;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x4ECE;&#x6839;&#x7ED3;&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x5148;&#x904D;&#x5386;&#x5DE6;&#x5B50;&#x6811;&#xFF0C;&#x7136;&#x540E;&#x904D;&#x5386;&#x53F3;&#x5B50;&#x6811;&#x3002;</p>
</li>
<li><p><strong>&#x5C42;&#x5E8F;&#x904D;&#x5386;</strong>
   &#x5982;&#x679C;&#x4E8C;&#x53C9;&#x6811;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x4ECE;&#x6811;&#x7684;&#x7B2C;&#x4E00;&#x5C42;&#xFF0C;&#x6839;&#x7ED3;&#x70B9;&#x5F00;&#x59CB;&#x8BBF;&#x95EE;&#xFF0C;&#x4ECE;&#x4E0A;&#x800C;&#x4E0B;&#x9010;&#x5C42;&#x904D;&#x5386;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x5C42;&#x4E2D;&#xFF0C;&#x6309;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x7684;&#x987A;&#x5E8F;&#x9010;&#x4E2A;&#x7ED3;&#x70B9;&#x8BBF;&#x95EE;&#x3002;</p>
</li>
</ul>
</blockquote>
<h3 id="27-&#x6563;&#x5217;&#x8868;hash&#x8868;">2.7 &#x6563;&#x5217;&#x8868;(Hash&#x8868;)</h3>
<p>&#x6563;&#x5217;&#x8868;&#xFF0C;&#x4E5F;&#x53EB;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x662F;&#x6839;&#x636E;&#x5173;&#x952E;&#x7801;&#x548C;&#x503C; (key&#x548C;value) &#x76F4;&#x63A5;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x901A;&#x8FC7;key&#x548C;value&#x6765;&#x6620;&#x5C04;&#x5230;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;python&#x4E2D;&#x7684;&#x5B57;&#x5178;&#x548C;java&#x7684;map&#x3002;</p>
<p>&#x6563;&#x5217;&#x8868;&#x5C31;&#x662F;&#x628A;Key&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x7B97;&#x6CD5;&#x51FD;&#x6570;&#x65E2;&#x6240;&#x8C13;&#x7684;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x6574;&#x578B;&#x6570;&#x5B57;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x5C06;&#x8BE5;&#x6570;&#x5B57;&#x5BF9;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x8FDB;&#x884C;&#x53D6;&#x4F59;&#xFF0C;&#x53D6;&#x4F59;&#x7ED3;&#x679C;&#x5C31;&#x5F53;&#x4F5C;&#x6570;&#x7EC4;&#x7684;&#x4E0B;&#x6807;&#xFF0C;&#x5C06;value&#x5B58;&#x50A8;&#x5728;&#x4EE5;&#x8BE5;&#x6570;&#x5B57;&#x4E3A;&#x4E0B;&#x6807;&#x7684;&#x6570;&#x7EC4;&#x7A7A;&#x95F4;&#x91CC;&#xFF0C;&#x8FD9;&#x79CD;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x5145;&#x5206;&#x5229;&#x7528;&#x6570;&#x7EC4;&#x7684;&#x67E5;&#x627E;&#x4F18;&#x52BF;&#x6765;&#x67E5;&#x627E;&#x5143;&#x7D20;&#xFF0C;&#x6240;&#x4EE5;&#x67E5;&#x627E;&#x7684;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#x3002;</p>
<blockquote>
<p>Addr = H&#xFF08;key&#xFF09;</p>
<p>H&#x4E3A;&#x54C8;&#x5E0C;&#x51FD;&#x6570;(&#x6563;&#x5217;&#x51FD;&#x6570;)&#xFF0C;</p>
</blockquote>
<p><img src="hashDS-1582403044966.png" alt="hashDS"></p>
<p>&#x6563;&#x5217;&#x8868;&#x5C31;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x548C;&#x591A;&#x4E2A;&#x94FE;&#x8868;&#x7EC4;&#x6210;&#x3002;</p>
<h3 id="28-&#x5806;-heap">2.8 &#x5806;-Heap</h3>
<p>&#x5806;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x662F;&#x7528;&#x6570;&#x7EC4;&#x5B9E;&#x73B0;&#x7684;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x6307;&#x9488;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x5806;&#x5C5E;&#x6027;&#x51B3;&#x5B9A;&#x6811;&#x4E2D;&#x8282;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x5728;&#x6570;&#x7EC4;&#x653E;&#x5165;&#x5806;&#x7684;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x5806;&#x7531;&#x5982;&#x4E0B;&#x6027;&#x8D28;&#xFF1A;</p>
<ul>
<li>&#x5806;&#x4E2D;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x503C;&#x603B;&#x662F;&#x4E0D;&#x5927;&#x4E8E;&#x6216;&#x4E0D;&#x5C0F;&#x4E8E;&#x5176;&#x7236;&#x8282;&#x70B9;&#x7684;&#x503C;&#xFF1B;</li>
<li>&#x5806;&#x5FC5;&#x5B9A;&#x662F;&#x4E00;&#x9897;&#x5B8C;&#x5168;&#x4E8C;&#x53C9;&#x6811;</li>
</ul>
<p>&#x5806;&#x6709;&#x4E24;&#x79CD;&#xFF1A;&#x6700;&#x5927;&#x5806;&#x548C;&#x6700;&#x5C0F;&#x5806;&#xFF0C;&#x6700;&#x5927;&#x5806;&#x7684;&#x7236;&#x8282;&#x70B9;&#x6BD4;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x503C;&#x90FD;&#x5927;&#xFF0C;&#x53CD;&#x4E4B;&#xFF0C;&#x6700;&#x5C0F;&#x5806;&#x7684;&#x7236;&#x8282;&#x70B9;&#x6BD4;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x503C;&#x90FD;&#x5C0F;&#xFF0C;&#x5373;&#x5806;&#x5C5E;&#x6027;&#x3002;</p>
<h3 id="29-&#x56FE;">2.9 &#x56FE;</h3>
<p>&#x56FE;&#x662F;&#x4E00;&#x79CD;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x7ED3;&#x6784;&#x5F62;&#x5F0F;&#x662F;&#x62D3;&#x6251;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x5E38;&#x7528;&#x4E8E;&#x8DEF;&#x5F84;&#x89C4;&#x5212;&#x4E2D;&#x3002;&#x5176;&#x8868;&#x793A;&#x6CD5;&#x591A;&#x79CD;&#x591A;&#x6837;&#x3002;</p>
<p>&#x56FE;G&#x7531;&#x9876;&#x70B9;&#x96C6;V&#x548C;&#x8FB9;&#x96C6;E&#x7EC4;&#x6210;&#xFF0C;&#x8BB0;&#x4E3A;G=(V,E)&#xFF0C;&#x5176;&#x4E2D;V(G)&#x8868;&#x793A;&#x56FE;G&#x4E2D;&#x9876;&#x70B9;&#x7684;&#x6709;&#x9650;&#x975E;&#x7A7A;&#x96C6;&#xFF1B;E(G)&#x8868;&#x793A;&#x56FE;G&#x4E2D;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;(&#x8FB9;)&#x7684;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x56FE;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x6CA1;&#x6709;&#x8FB9;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x662F;&#x7A7A;&#x56FE;&#x3002;</p>
<blockquote>
<h6 id="&#x56FE;&#x7684;&#x57FA;&#x672C;&#x8868;&#x793A;&#x6CD5;">&#x56FE;&#x7684;&#x57FA;&#x672C;&#x8868;&#x793A;&#x6CD5;</h6>
</blockquote>
<p>&#x56FE; $G=(V,E)$ &#x7531;&#x4E0B;&#x5217;&#x8981;&#x7D20;&#x6784;&#x6210;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x7EC4;&#x8282;&#x70B9;(verticle) V=1, &#x2026; , n</li>
<li>&#x4E00;&#x7EC4;&#x8FB9; E(edge)</li>
<li>&#x8FB9;$(i,j)$&#x8FDE;&#x63A5;&#x4E86;&#x8282;&#x70B9;&#x548C;j&#xFF0C;$i$&#x548C;$j$&#x88AB;&#x79F0;&#x4E3A;&#x76F8;&#x90BB;&#x8282;&#x70B9;</li>
<li>&#x8282;&#x70B9;&#x7684;&#x5EA6;(degree)&#x662F;&#x76F8;&#x90BB;&#x8282;&#x70B9;&#x7684;&#x6570;&#x91CF;</li>
</ul>
<p><strong>&#x51FA;&#x5EA6;&#x548C;&#x5165;&#x5EA6;</strong></p>
<p>&#x51FA;&#x5EA6;&#x548C;&#x5165;&#x8BFB;&#x9488;&#x5BF9;&#x7684;&#x662F;&#x6709;&#x5411;&#x56FE;</p>
<ul>
<li>&#x51FA;&#x5EA6;&#xFF1A;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x9876;&#x70B9;V&#xFF0C;&#x7BAD;&#x5934;&#x8FDC;&#x79BB;&#x8BE5;&#x9876;&#x70B9;&#x7684;&#x8FB9;&#x6570;&#x91CF;(InDegree, &#x8BB0;&#x4F5C;ID(V))</li>
<li>&#x5165;&#x5EA6;&#xFF1A;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x7BAD;&#x5934;&#x6307;&#x5411;&#x8BE5;&#x9876;&#x70B9;&#x7684;&#x8FB9;&#x6570;&#x91CF;(OutDegree&#xFF0C;&#x8BB0;&#x4F5C;OD(V))</li>
</ul>
<p><strong>&#x90BB;&#x63A5;&#x9876;&#x70B9;</strong></p>
<ul>
<li><p>&#x5165;&#x8FB9;&#x90BB;&#x63A5;&#x9876;&#x70B9;&#xFF1A;&#x8FDE;&#x63A5;&#x8BE5;&#x9876;&#x70B9;&#x7684;&#x8FB9;&#x4E2D;&#x7684;&#x8D77;&#x59CB;&#x9876;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x51FA;&#x8FB9;&#x90BB;&#x63A5;&#x9876;&#x70B9;&#xFF1A;&#x8FDE;&#x63A5;&#x8BE5;&#x9876;&#x70B9;&#x7684;&#x8FB9;&#x4E2D;&#x7684;&#x7ED3;&#x675F;&#x9876;&#x70B9;&#x3002;</p>
</li>
</ul>
<p><strong>&#x96C6;&#x5408;VR</strong></p>
<p>VR &#x8868;&#x793A;&#x56FE;&#x4E2D;&#x6240;&#x6709;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7684;&#x96C6;&#x5408;&#x3002; VR={(v1,v2),(v1,v4),(v1,v3),(v3,v4)}</p>
<blockquote>
<h6 id="&#x56FE;&#x7684;&#x5206;&#x7C7B;">&#x56FE;&#x7684;&#x5206;&#x7C7B;</h6>
</blockquote>
<p><strong>&#x4F9D;&#x636E;&#x56FE;&#x7684;&#x65B9;&#x5411;&#x5206;&#x79BB;&#x5206;&#x7C7B;</strong></p>
<ul>
<li><p>&#x6709;&#x5411;&#x56FE;&#xFF1A;E&#x662F;&#x6709;&#x5411;&#x8FB9;&#x7684;&#x6709;&#x9650;&#x96C6;&#x5408;&#x3002;&#x6B64;&#x65F6;$<u,v>$&#x8868;&#x793A;&#x6709;&#x5411;&#x8FB9;&#xFF0C;&#x7B80;&#x79F0;&#x5F27;&#x3002;</u,v></p>
</li>
<li><p>&#x65E0;&#x5411;&#x56FE;&#xFF1A;E&#x662F;&#x65E0;&#x5411;&#x8FB9;&#x7684;&#x6709;&#x9650;&#x96C6;&#x5408;&#x3002;&#x6B64;&#x65F6;$(u,v)$&#x6216;$(v,u)$&#x8868;&#x793A;&#x9876;&#x70B9;&#x65E0;&#x5E8F;&#x5BF9;&#x3002;</p>
</li>
</ul>
<p><strong>&#x7B80;&#x5355;&#x56FE;</strong>&#xFF1A;</p>
<ul>
<li>&#x4E0D;&#x5B58;&#x5728;&#x91CD;&#x590D;&#x8FB9;</li>
<li>&#x4E0D;&#x5B58;&#x5728;&#x9876;&#x70B9;&#x5230;&#x81EA;&#x8EAB;&#x7684;&#x8FB9;</li>
</ul>
<p><strong>&#x591A;&#x91CD;&#x56FE;&#xFF1A;</strong></p>
<ul>
<li>&#x4E24;&#x4E2A;&#x7ED3;&#x70B9;&#x76F4;&#x63A5;&#x8FB9;&#x6570;&#x591A;&#x4E8E;&#x4E00;&#x6761;&#xFF0C;&#x5141;&#x8BB8;&#x9876;&#x70B9;&#x5230;&#x81EA;&#x8EAB;&#x7684;&#x8FB9;</li>
</ul>
<p><strong>&#x5B8C;&#x5168;&#x56FE;&#xFF1A;</strong></p>
<ul>
<li>&#x65E0;&#x5411;&#x56FE;&#x4E2D;&#x4EFB;&#x610F;&#x4E24;&#x70B9;&#x4E4B;&#x95F4;&#x90FD;&#x5B58;&#x5728;&#x56FE;&#x79F0;&#x4E3A;&#x65E0;&#x5411;&#x5B8C;&#x5168;&#x56FE;&#xFF1B;</li>
<li>&#x6709;&#x5411;&#x56FE;&#x4E2D;&#x4EFB;&#x610F;&#x4E24;&#x70B9;&#x4E4B;&#x95F4;&#x90FD;&#x5B58;&#x5728;&#x65B9;&#x5411;&#x76F8;&#x53CD;&#x7684;&#x4E24;&#x6761;&#x5F27;&#x79F0;&#x4E3A;&#x6709;&#x5411;&#x5B8C;&#x5168;&#x56FE;&#x3002;</li>
</ul>
<p>&#x5177;&#x6709; n &#x4E2A;&#x9876;&#x70B9;&#x7684;&#x5B8C;&#x5168;&#x56FE;&#xFF0C;&#x56FE;&#x4E2D;&#x8FB9;&#x7684;&#x6570;&#x91CF;&#x4E3A; n(n-1)/2&#xFF1B;&#x800C;&#x5BF9;&#x4E8E;&#x5177;&#x6709; n &#x4E2A;&#x9876;&#x70B9;&#x7684;&#x6709;&#x5411;&#x5B8C;&#x5168;&#x56FE;&#xFF0C;&#x56FE;&#x4E2D;&#x5F27;&#x7684;&#x6570;&#x91CF;&#x4E3A; n(n-1)</p>
<p><strong>&#x5B50;&#x56FE;</strong></p>
<p>&#x82E5;&#x4E24;&#x4E2A;&#x56FE;$G1=(V1,E1),G2=(V1,E2)$,$V2$&#x662F;$V1$&#x7684;&#x5B50;&#x96C6;&#x4E14;$E2$&#x662F;$E1$&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x79F0;G2&#x662F;G1&#x7684;&#x5B50;&#x56FE;</p>
<p><strong>&#x8FDE;&#x901A;&#xFF0C;&#x8FDE;&#x901A;&#x56FE;&#xFF0C;&#x8FDE;&#x901A;&#x5206;&#x91CF;</strong></p>
<p>&#x9488;&#x5BF9;&#x65E0;&#x5411;&#x56FE;&#x3002;&#x5728;&#x65E0;&#x5411;&#x56FE;&#x4E2D;&#xFF0C;&#x4E24;&#x9876;&#x70B9;&#x95F4;&#x6709;&#x8FB9;&#x8FDE;&#x63A5;&#xFF0C;&#x79F0;&#x4E3A;&#x8FDE;&#x901A;&#x7684;&#x3002;&#x82E5;&#x4EFB;&#x610F;&#x4E24;&#x9876;&#x70B9;&#x90FD;&#x8FDE;&#x901A;&#xFF0C;&#x79F0;&#x6B64;&#x56FE;&#x4E3A;&#x8FDE;&#x901A;&#x56FE;&#x3002;&#x65E0;&#x5411;&#x56FE;&#x4E2D;&#x7684;&#x6781;&#x5927;&#x8FDE;&#x901A;&#x5B50;&#x56FE;&#x79F0;&#x4E3A;&#x8FDE;&#x901A;&#x91CF;&#x3002;</p>
<p><strong>&#x5F3A;&#x8FDE;&#x901A;&#x56FE;&#xFF0C;&#x5F3A;&#x8FDE;&#x901A;&#x91CF;</strong></p>
<p>&#x9488;&#x5BF9;&#x6709;&#x5411;&#x56FE;&#x3002;&#x5728;&#x6709;&#x5411;&#x56FE;&#x4E2D;&#xFF0C;&#x4E24;&#x9876;&#x70B9;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x90FD;&#x6709;&#x8DEF;&#x5F84;&#xFF0C;&#x4E24;&#x9876;&#x70B9;&#x79F0;&#x4E3A;&#x5F3A;&#x8FDE;&#x901A;&#x3002;&#x82E5;&#x4EFB;&#x4E00;&#x9876;&#x70B9;&#x90FD;&#x662F;&#x5F3A;&#x8FDE;&#x901A;&#x56FE;&#x3002;&#x6709;&#x5411;&#x56FE;&#x4E2D;&#x7684;&#x6781;&#x5927;&#x5F3A;&#x8FDE;&#x901A;&#x5B50;&#x56FE;&#x4E3A;&#x6709;&#x5411;&#x56FE;&#x7684;&#x5F3A;&#x8FDE;&#x901A;&#x5206;&#x91CF;&#x3002;</p>
<p><strong>&#x8DEF;&#x5F84;&#x548C;&#x56DE;&#x8DEF;</strong></p>
<p>&#x65E0;&#x8BBA;&#x662F;&#x65E0;&#x5411;&#x56FE;&#x8FD8;&#x662F;&#x6709;&#x5411;&#x56FE;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x5230;&#x53E6;&#x4E00;&#x9876;&#x70B9;&#x9014;&#x5F84;&#x7684;&#x6240;&#x6709;&#x9876;&#x70B9;&#x7EC4;&#x6210;&#x7684;&#x5E8F;&#x5217;&#xFF08;&#x5305;&#x542B;&#x8FD9;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#xFF09;&#xFF0C;&#x79F0;&#x4E3A;&#x4E00;&#x6761;&#x8DEF;&#x5F84;&#x3002;&#x5982;&#x679C;&#x8DEF;&#x5F84;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x76F8;&#x540C;&#xFF0C;&#x5219;&#x6B64;&#x8DEF;&#x5F84;&#x79F0;&#x4E3A;&quot;&#x56DE;&#x8DEF;&quot;&#xFF08;&#x6216;&quot;&#x73AF;&quot;&#xFF09;&#x3002;</p>
<p>&#x5E76;&#x4E14;&#xFF0C;&#x82E5;&#x8DEF;&#x5F84;&#x4E2D;&#x5404;&#x9876;&#x70B9;&#x90FD;&#x4E0D;&#x91CD;&#x590D;&#xFF0C;&#x6B64;&#x8DEF;&#x5F84;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;&quot;&#x7B80;&#x5355;&#x8DEF;&#x5F84;&quot;&#xFF1B;&#x540C;&#x6837;&#xFF0C;&#x82E5;&#x56DE;&#x8DEF;&#x4E2D;&#x7684;&#x9876;&#x70B9;&#x4E92;&#x4E0D;&#x91CD;&#x590D;&#xFF0C;&#x6B64;&#x56DE;&#x8DEF;&#x88AB;&#x79F0;&#x4E3A;&quot;&#x7B80;&#x5355;&#x56DE;&#x8DEF;&quot;&#xFF08;&#x6216;&#x7B80;&#x5355;&#x73AF;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x6709;&#x5411;&#x56FE;&#x4E2D;&#xFF0C;&#x6BCF;&#x6761;&#x8DEF;&#x5F84;&#x6216;&#x56DE;&#x8DEF;&#x90FD;&#x662F;&#x6709;&#x65B9;&#x5411;&#x7684;&#x3002;</p>
<p><strong>&#x6743;&#x548C;&#x7F51;&#x7684;&#x542B;&#x4E49;</strong></p>
<p>&#x5728;&#x67D0;&#x4E9B;&#x5B9E;&#x9645;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x56FE;&#x4E2D;&#x7684;&#x6BCF;&#x6761;&#x8FB9;&#xFF08;&#x6216;&#x5F27;&#xFF09;&#x4F1A;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x5B9E;&#x6570;&#x6765;&#x8868;&#x793A;&#x4E00;&#x5B9A;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x8FD9;&#x79CD;&#x4E0E;&#x8FB9;&#xFF08;&#x6216;&#x5F27;&#xFF09;&#x76F8;&#x5339;&#x914D;&#x7684;&#x5B9E;&#x6570;&#x88AB;&#x79F0;&#x4E3A;&quot;&#x6743;&quot;&#xFF1B;</p>
<p>&#x5E26;&#x6743;&#x7684;&#x56FE;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x7F51;&#x3002;</p>
<p><strong>&#x6709;&#x5411;&#x65E0;&#x73AF;&#x56FE;(DAG&#x56FE;)</strong></p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6709;&#x5411;&#x56FE;&#x65E0;&#x6CD5;&#x4ECE;&#x67D0;&#x4E2A;&#x9876;&#x70B9;&#x51FA;&#x53D1;&#x7ECF;&#x8FC7;&#x82E5;&#x5E72;&#x6761;&#x8FB9;&#x56DE;&#x5230;&#x8BE5;&#x70B9;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x56FE;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x5411;&#x65E0;&#x73AF;&#x56FE;&#x3002;</p>
<p>&#x6709;&#x5411;&#x65E0;&#x73AF;&#x56FE;&#x5E94;&#x7528;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;</p>
<blockquote>
<h6 id="&#x56FE;&#x7684;&#x5176;&#x4ED6;&#x6982;&#x5FF5;">&#x56FE;&#x7684;&#x5176;&#x4ED6;&#x6982;&#x5FF5;</h6>
</blockquote>
<p><strong>&#x751F;&#x6210;&#x6811;</strong></p>
<p>&#x751F;&#x6210;&#x6811;&#xFF1A;&#x904D;&#x5386;&#x8FDE;&#x901A;&#x56FE;&#xFF0C;&#x4F9D;&#x636E;&#x8BBF;&#x95EE;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C06;&#x56FE;&#x5C55;&#x5F00;&#x6210;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x6811;&#xFF0C;&#x5373;&#x4E3A;&#x751F;&#x6210;&#x6811;&#x3002;</p>
<blockquote>
<p>&#x8FDE;&#x901A;&#x56FE;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x4EFB;&#x610F;&#x4E24;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x53EF;&#x80FD;&#x542B;&#x6709;&#x591A;&#x6761;&#x901A;&#x8DEF;&#xFF0C;&#x904D;&#x5386;&#x8FDE;&#x901A;&#x56FE;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x591A;&#x79CD;&#xFF0C;&#x5F80;&#x5F80;&#x4E00;&#x5F20;&#x8FDE;&#x901A;&#x56FE;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x751F;&#x6210;&#x6811;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x3002;</p>
</blockquote>
<p>&#x8FDE;&#x901A;&#x56FE;&#x4E2D;&#x7684;&#x751F;&#x6210;&#x6811;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B; 2 &#x4E2A;&#x6761;&#x4EF6;&#xFF1A;</p>
<ul>
<li><p>&#x5305;&#x542B;&#x8FDE;&#x901A;&#x56FE;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x9876;&#x70B9;&#xFF1B;</p>
</li>
<li><p>&#x4EFB;&#x610F;&#x4E24;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x6709;&#x4E14;&#x4EC5;&#x6709;&#x4E00;&#x6761;&#x901A;&#x8DEF;&#xFF1B;</p>
</li>
</ul>
<p>&#x8FDE;&#x901A;&#x56FE;&#x7684;&#x751F;&#x6210;&#x6811;&#x5177;&#x6709;&#x7279;&#x5F81;&#xFF1A;&#x8FB9;&#x6570;&#x91CF;=&#x9876;&#x70B9;&#x6811;-1</p>
<p><strong>&#x751F;&#x6210;&#x68EE;&#x6797;</strong></p>
<p>&#x751F;&#x6210;&#x6811;&#x9488;&#x5BF9;&#x7684;&#x662F;&#x8FDE;&#x901A;&#x56FE;&#xFF0C;&#x751F;&#x6210;&#x68EE;&#x6797;&#x9488;&#x5BF9;&#x7684;&#x975E;&#x8FDE;&#x901A;&#x56FE;&#x3002;</p>
<p>&#x975E;&#x8FDE;&#x901A;&#x56FE;&#x53EF;&#x4EE5;&#x5206;&#x89E3;&#x4E3A;&#x591A;&#x4E2A;&#x8FDE;&#x901A;&#x5206;&#x91CF;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDE;&#x901A;&#x5206;&#x91CF;&#x53C8;&#x5404;&#x81EA;&#x5BF9;&#x5E94;&#x591A;&#x4E2A;&#x751F;&#x6210;&#x6811;&#xFF0C;&#x7531;&#x8FD9;&#x4E9B;&#x751F;&#x6210;&#x6811;&#x6784;&#x6210;&#x68EE;&#x6797;&#x5373;&#x975E;&#x8FDE;&#x901A;&#x56FE;&#x7684;&#x751F;&#x6210;&#x68EE;&#x6797;&#x3002;</p>
<blockquote>
<h6 id="&#x56FE;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;">&#x56FE;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;</h6>
</blockquote>
<p><strong>&#x987A;&#x5E8F;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x2014;&#x90BB;&#x63A5;&#x77E9;&#x9635;</strong></p>
<p>&#x91C7;&#x7528;&#x4E24;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x4E00;&#x4E2A;&#x4E00;&#x7EF4;&#x6570;&#x7EC4;&#x5B58;&#x50A8;&#x9876;&#x70B9;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;&#x5B58;&#x50A8;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;&#x79F0;&#x4E3A;&#x90BB;&#x63A5;&#x77E9;&#x9635;&#xFF0C;&#x663E;&#x7136;&#x662F;&#x4E00;&#x4E2A;n&#x9636;&#x65B9;&#x9635;&#x3002;&#x4E24;&#x4E2A;&#x6570;&#x7EC4;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x6807;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x5173;&#x7CFB;&#x4ECE;&#x800C;&#x5EFA;&#x7ACB;&#x4E86;&#x9876;&#x70B9;&#x4E0E;&#x8FB9;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<ul>
<li><p>&#x65E0;&#x5411;&#x56FE;&#x7684;&#x90BB;&#x63A5;&#x77E9;&#x9635;&#x662F;&#x5BF9;&#x79F0;&#x77E9;&#x9635;&#xFF0C;n&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x65E0;&#x5411;&#x56FE;&#x9700;&#x8981;$n*(n+1)/2$&#x4E2A;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;</p>
</li>
<li><p>&#x6709;&#x5411;&#x56FE;&#x7684;&#x90BB;&#x63A5;&#x77E9;&#x9635;&#x4E0D;&#x4E00;&#x5B9A;&#x5BF9;&#x79F0;&#xFF0C;n&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x6709;&#x5411;&#x56FE;&#x9700;&#x8981;$n^2$&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;</p>
</li>
<li><p>&#x65E0;&#x5411;&#x56FE;&#x4E2D;&#x7B2C; $i$ &#x884C;&#x7684;&#x975E;&#x96F6;&#x5143;&#x7D20;&#x7684;&#x4E2A;&#x6570;&#x4E3A;&#x9876;&#x70B9;$V_i$&#x7684;&#x5EA6;</p>
</li>
<li><p>&#x6709;&#x5411;&#x56FE;&#x4E2D;&#x7B2C; $i$ &#x884C;&#x7684;&#x975E;&#x96F6;&#x5143;&#x7D20;&#x7684;&#x4E2A;&#x6570;&#x4E3A;&#x9876;&#x70B9; $V_i$ &#x7684;&#x51FA;&#x5EA6;&#xFF0C;&#x7B2C;i&#x5217;&#x7684;&#x975E;&#x96F6;&#x5143;&#x7D20;&#x7684;&#x4E2A;&#x6570;&#x4E3A;&#x9876;&#x70B9;$ V_i $&#x7684;&#x5165;&#x5EA6;&#x3002;</p>
</li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x90BB;&#x63A5;&#x77E9;&#x9635;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x5B9A;&#x4E49;&#x89C4;&#x5219;</p>
<ul>
<li>&#x5982;&#x679C;G&#x662F;&#x65E0;&#x5411;&#x56FE;&#xFF0C;&#x5219;&#xFF1A;</li>
</ul>
<pre class="language-"><code class="lang-mathematica">  A[i][j]=1&#xFF1A;&#x82E5;(i,j)&#x2208;E(G)   0:&#x5176;&#x4ED6;
</code></pre>
<ul>
<li>&#x5982;&#x679C;G&#x662F;&#x6709;&#x5411;&#x56FE;&#xFF0C;&#x5219;&#xFF1A;</li>
</ul>
<pre class="language-"><code class="lang-mathematica">  A[i][j]=1&#xFF1A;&#x82E5;<span class="token tag"><span class="token tag"><span class="token punctuation">&lt;</span>i,j</span><span class="token punctuation">&gt;</span></span>&#x2208;E(G)  0:&#x5176;&#x4ED6;
</code></pre>
<ul>
<li>&#x5982;&#x679C;G&#x662F;&#x5E26;&#x6743;&#x65E0;&#x5411;&#x56FE;&#xFF0C;&#x5219;&#xFF1A;</li>
</ul>
<pre class="language-"><code class="lang-mathematica">  A[i][j]= w[i][j] &#xFF1A;&#x82E5;i&#x2260;j&#x4E14;(i,j)&#x2208;E(G)    0&#xFF1A;i=j    &#x221E;&#xFF1A;&#x5176;&#x4ED6;
</code></pre>
<ul>
<li>&#x5982;&#x679C;G&#x662F;&#x5E26;&#x6743;&#x6709;&#x5411;&#x56FE;&#xFF0C;&#x5219;&#xFF1A;</li>
</ul>
<pre class="language-"><code class="lang-mathematica">A[i][j]=  w[i][j] &#xFF1A;&#x82E5;i&#x2260;j&#x4E14;<span class="token tag"><span class="token tag"><span class="token punctuation">&lt;</span>i,j</span><span class="token punctuation">&gt;</span></span>&#x2208;E(G)   0&#xFF1A;i=j&#x3000;&#x221E;&#xFF1A;&#x5176;&#x4ED6;
</code></pre>
<p><strong>&#x90BB;&#x63A5;&#x8868;&#x5B58;&#x50A8;&#x7ED3;&#x6784;</strong></p>
<p>&#x4E3A;&#x56FE;G&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x94FE;&#x8868;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5355;&#x94FE;&#x8868;&#xFF0C;&#x6BCF;&#x6761;&#x94FE;&#x8868;&#x7684;&#x8868;&#x5934;&#x5143;&#x7D20;&#x4E3A;&#x56FE;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x94FE;&#x8868;&#x5143;&#x7D20;&#x4E3A;&#x8BE5;&#x9876;&#x70B9;&#x4E0E;&#x90BB;&#x63A5;&#x9876;&#x70B9;&#x7684;&#x8FB9;&#x4FE1;&#x606F;&#x3002;</p>
<ul>
<li><p>&#x65E0;&#x5411;&#x56FE;&#x9876;&#x70B9;&#x7684;&#x5EA6;&#x4E3A;&#x8BE5;&#x9876;&#x70B9;&#x5BF9;&#x5E94;&#x94FE;&#x8868;&#x7684;&#x7ED3;&#x70B9;&#x6570;&#x91CF;&#x3002;</p>
</li>
<li><p>&#x6709;&#x5411;&#x56FE;&#x7684;&#x90BB;&#x63A5;&#x8868;&#xFF1A;</p>
<p>  &#x9ED8;&#x8BA4;&#x90BB;&#x63A5;&#x8868;&#x53EA;&#x5B58;&#x50A8;&#x6307;&#x5411;&#x8BE5;&#x9876;&#x70B9;&#x7684;&#x90BB;&#x63A5;&#x9876;&#x70B9;</p>
<p>  &#x9006;&#x90BB;&#x63A5;&#x8868;&#x53EA;&#x5B58;&#x50A8;&#x4EE5;&#x9876;&#x70B9;&#x4E3A;&#x5934;&#x7684;&#x90BB;&#x63A5;&#x9876;&#x70B9;</p>
</li>
</ul>
<p>&#x7279;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x90BB;&#x63A5;&#x8868;&#x8868;&#x793A;&#x4E0D;&#x552F;&#x4E00;&#x3002;</li>
<li><p>&#x90BB;&#x63A5;&#x8868;&#x5224;&#x65AD;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x662F;&#x5426;&#x5B58;&#x5728;&#x8868;&#x9700;&#x8981;&#x67E5;&#x8BE2;&#x4E24;&#x4E2A;&#x5355;&#x94FE;&#x8868;</p>
</li>
<li><p>&#x90BB;&#x63A5;&#x8868;&#x5B58;&#x50A8;&#x8282;&#x7701;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x7279;&#x522B;&#x5728;&#x8FB9;&#x7A00;&#x758F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;(E&lt;&lt;n(n-1)/2)</p>
</li>
<li>&#x90BB;&#x63A5;&#x8868;&#x9002;&#x5408;&#x65E0;&#x5411;&#x56FE;&#x7684;&#x5B58;&#x50A8;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x5411;&#x56FE;&#x7684;&#x90BB;&#x63A5;&#x8868;&#x53EA;&#x5B58;&#x50A8;&#x90E8;&#x5206;&#x90BB;&#x63A5;&#x9876;&#x70B9;&#x7684;&#x5173;&#x7CFB;&#x3002;</li>
</ul>
<p><strong>&#x5341;&#x5B57;&#x94FE;&#x8868;&#x5B58;&#x50A8;&#x7ED3;&#x6784;</strong></p>
<p>&#x5341;&#x5B57;&#x94FE;&#x8868;&#x9002;&#x5408;&#x5B58;&#x50A8;&#x6709;&#x5411;&#x56FE;&#xFF0C;&#x662F;&#x90BB;&#x63A5;&#x8868;&#x4E0E;&#x9006;&#x90BB;&#x63A5;&#x8868;&#x7684;&#x7ED3;&#x5408;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x6761;&#x94FE;&#x8868;&#x7531;&#x9876;&#x70B9;node&#x548C;&#x8FB9;node&#x7EC4;&#x6210;</p>
<p><img src="Vnode.gif" alt="Vnode"></p>
<p>&#x9996;&#x5143;&#x8282;&#x70B9;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x57DF;&#x548C;&#x4E24;&#x4E2A;&#x6307;&#x9488;&#x57DF;&#xFF08;&#x5206;&#x522B;&#x7528; firstin &#x548C; firstout &#x8868;&#x793A;&#xFF09;&#xFF1A;</p>
<ul>
<li>firstin &#x6307;&#x9488;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x4EE5;&#x5F53;&#x524D;&#x9876;&#x70B9;&#x4E3A;&#x5F27;&#x5934;&#x7684;&#x5176;&#x4ED6;&#x9876;&#x70B9;&#x6784;&#x6210;&#x7684;&#x94FE;&#x8868;&#xFF1B;</li>
<li>firstout &#x6307;&#x9488;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x4EE5;&#x5F53;&#x524D;&#x9876;&#x70B9;&#x4E3A;&#x5F27;&#x5C3E;&#x7684;&#x5176;&#x4ED6;&#x9876;&#x70B9;&#x6784;&#x6210;&#x7684;&#x94FE;&#x8868;&#xFF1B;</li>
<li>data &#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x8BE5;&#x9876;&#x70B9;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF1B;</li>
</ul>
<p><img src="Enode.gif" alt="Enode"></p>
<p>&#x5341;&#x5B57;&#x94FE;&#x8868;&#x4E2D;&#x666E;&#x901A;&#x8282;&#x70B9;&#x7684;&#x5B58;&#x50A8;&#x5206;&#x4E3A; 5 &#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x4F5C;&#x7528;&#x662F;&#xFF1A;</p>
<ul>
<li>tailvex &#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x4EE5;&#x9996;&#x5143;&#x8282;&#x70B9;&#x4E3A;&#x5F27;&#x5C3E;&#x7684;&#x9876;&#x70B9;&#x4F4D;&#x4E8E;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x4E0B;&#x6807;&#xFF1B;</li>
<li>headvex &#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x4EE5;&#x9996;&#x5143;&#x8282;&#x70B9;&#x4E3A;&#x5F27;&#x5934;&#x7684;&#x9876;&#x70B9;&#x4F4D;&#x4E8E;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x4E0B;&#x6807;&#xFF1B;</li>
<li>hlink &#x6307;&#x9488;&#xFF1A;&#x7528;&#x4E8E;&#x94FE;&#x63A5;&#x4E0B;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x4EE5;&#x9996;&#x5143;&#x8282;&#x70B9;&#x4E3A;&#x5F27;&#x5934;&#x7684;&#x9876;&#x70B9;&#x7684;&#x8282;&#x70B9;&#xFF1B;</li>
<li>tlink &#x6307;&#x9488;&#xFF1A;&#x7528;&#x4E8E;&#x94FE;&#x63A5;&#x4E0B;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x4EE5;&#x9996;&#x5143;&#x8282;&#x70B9;&#x4E3A;&#x5F27;&#x5C3E;&#x7684;&#x9876;&#x70B9;&#x7684;&#x8282;&#x70B9;&#xFF1B;</li>
<li>info &#x6307;&#x9488;&#xFF1A;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x4E0E;&#x8BE5;&#x9876;&#x70B9;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x91CF;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x6743;&#x503C;&#xFF1B;</li>
</ul>
<p><img src="100H63610-2.gif" alt="100H63610-2"></p>
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6A2A;&#x5411;&#x8868;&#x793A;&#x51FA;&#x5EA6;&#xFF0C;&#x7EB5;&#x5411;&#x662F;&#x5165;&#x5EA6;</p>
<p><strong>&#x90BB;&#x63A5;&#x591A;&#x91CD;&#x8868;</strong></p>
<p>&#x90BB;&#x63A5;&#x591A;&#x91CD;&#x8868;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x65E0;&#x5411;&#x56FE;&#x6216;&#x65E0;&#x5411;&#x7F51;</p>
<p><img src="100P515D-0.gif" alt="100P515D-0"></p>
<ul>
<li>data&#xFF1A;&#x5B58;&#x50A8;&#x6B64;&#x9876;&#x70B9;&#x7684;&#x6570;&#x636E;&#xFF1B;</li>
<li>firstedge&#xFF1A;&#x6307;&#x9488;&#x57DF;&#xFF0C;&#x7528;&#x4E8E;&#x6307;&#x5411;&#x540C;&#x8BE5;&#x9876;&#x70B9;&#x6709;&#x76F4;&#x63A5;&#x5173;&#x8054;&#x7684;&#x5B58;&#x50A8;&#x5176;&#x4ED6;&#x9876;&#x70B9;&#x7684;&#x8282;&#x70B9;&#x3002;</li>
</ul>
<p><img src="100P5M52-1.gif" alt="100P5M52-1"></p>
<ul>
<li>mark&#xFF1A;&#x6807;&#x5FD7;&#x57DF;&#xFF0C;&#x7528;&#x4E8E;&#x6807;&#x8BB0;&#x6B64;&#x8282;&#x70B9;&#x662F;&#x5426;&#x88AB;&#x64CD;&#x4F5C;&#x8FC7;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x5BF9;&#x56FE;&#x4E2D;&#x9876;&#x70B9;&#x505A;&#x904D;&#x5386;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x591A;&#x6B21;&#x64CD;&#x4F5C;&#x540C;&#x4E00;&#x8282;&#x70B9;&#xFF0C;mark &#x57DF;&#x4E3A; 0 &#x8868;&#x793A;&#x8FD8;&#x672A;&#x88AB;&#x904D;&#x5386;&#xFF1B;mark &#x4E3A; 1 &#x8868;&#x793A;&#x8BE5;&#x8282;&#x70B9;&#x5DF2;&#x88AB;&#x904D;&#x5386;&#xFF1B;</li>
<li>ivex &#x548C; jvex&#xFF1A;&#x6570;&#x636E;&#x57DF;&#xFF0C;&#x5206;&#x522B;&#x5B58;&#x50A8;&#x56FE;&#x4E2D;&#x5404;&#x8FB9;&#x4E24;&#x7AEF;&#x7684;&#x9876;&#x70B9;&#x6240;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x4E0B;&#x6807;&#xFF1B;</li>
<li>ilink&#xFF1A;&#x6307;&#x9488;&#x57DF;&#xFF0C;&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x4E0E; ivex &#x6709;&#x76F4;&#x63A5;&#x5173;&#x8054;&#x9876;&#x70B9;&#x7684;&#x8282;&#x70B9;&#xFF1B;</li>
<li>jlink&#xFF1A;&#x6307;&#x9488;&#x57DF;&#xFF0C;&#x6307;&#x5411;&#x4E0B;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x4E0E; jvex &#x6709;&#x76F4;&#x63A5;&#x5173;&#x8054;&#x9876;&#x70B9;&#x7684;&#x8282;&#x70B9;&#xFF1B;</li>
<li>info&#xFF1A;&#x6307;&#x9488;&#x57DF;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x4E0E;&#x8BE5;&#x9876;&#x70B9;&#x6709;&#x5173;&#x7684;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x65E0;&#x5411;&#x7F51;&#x4E2D;&#x5404;&#x8FB9;&#x7684;&#x6743;&#xFF1B;</li>
</ul>
<p><img src="100P54393-2.gif" alt="100P54393-2"></p>
<p><strong>&#x8FB9;&#x96C6;&#x6570;&#x7EC4;</strong></p>
<p>&#x96C6;&#x6570;&#x7EC4;&#x662F;&#x7531;&#x4E24;&#x4E2A;&#x4E00;&#x7EF4;&#x6570;&#x7EC4;&#x6784;&#x6210;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x5B58;&#x50A8;&#x9876;&#x70B9;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x5B58;&#x50A8;&#x8FB9;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FB9;&#x6570;&#x7EC4;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7531;&#x4E00;&#x6761;&#x8FB9;&#x7684;&#x8D77;&#x70B9;&#x4E0B;&#x6807;&#xFF08;begin&#xFF09;&#xFF0C;&#x7EC8;&#x70B9;&#x4E0B;&#x6807;&#xFF08;end&#xFF09;&#x548C;&#x6743;&#xFF08;weight&#xFF09;&#x7EC4;&#x6210;&#x3002;</p>
<blockquote>
<h6 id="&#x56FE;&#x7684;&#x904D;&#x5386;">&#x56FE;&#x7684;&#x904D;&#x5386;</h6>
</blockquote>
<p><strong>&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;DFS</strong></p>
<p>&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#xFF0C;&#x662F;&#x4ECE;&#x56FE;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x6BCF;&#x6B21;&#x904D;&#x5386;&#x5F53;&#x524D;&#x8BBF;&#x95EE;&#x9876;&#x70B9;&#x7684;&#x4E34;&#x754C;&#x70B9;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x8BBF;&#x95EE;&#x7684;&#x9876;&#x70B9;&#x6CA1;&#x6709;&#x672A;&#x88AB;&#x8BBF;&#x95EE;&#x8FC7;&#x7684;&#x4E34;&#x754C;&#x70B9;&#x4E3A;&#x6B62;&#x3002;&#x7136;&#x540E;&#x91C7;&#x7528;&#x4F9D;&#x6B21;&#x56DE;&#x9000;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x67E5;&#x770B;&#x6765;&#x7684;&#x8DEF;&#x4E0A;&#x6BCF;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x662F;&#x5426;&#x6709;&#x5176;&#x5B83;&#x672A;&#x88AB;&#x8BBF;&#x95EE;&#x7684;&#x4E34;&#x754C;&#x70B9;&#x3002;&#x8BBF;&#x95EE;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5224;&#x65AD;&#x56FE;&#x4E2D;&#x7684;&#x9876;&#x70B9;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x5168;&#x90E8;&#x904D;&#x5386;&#x5B8C;&#x6210;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x4EE5;&#x672A;&#x8BBF;&#x95EE;&#x7684;&#x9876;&#x70B9;&#x4E3A;&#x8D77;&#x59CB;&#x70B9;&#xFF0C;&#x91CD;&#x590D;&#x4E0A;&#x8FF0;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><strong>&#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;BFS</strong></p>
<p>&#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#x7C7B;&#x4F3C;&#x4E8E;&#x6811;&#x7684;&#x5C42;&#x6B21;&#x904D;&#x5386;&#x3002;&#x4ECE;&#x56FE;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x9876;&#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x904D;&#x5386;&#x6BCF;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x65F6;&#xFF0C;&#x4F9D;&#x6B21;&#x904D;&#x5386;&#x5176;&#x6240;&#x6709;&#x7684;&#x90BB;&#x63A5;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4ECE;&#x8FD9;&#x4E9B;&#x90BB;&#x63A5;&#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x540C;&#x6837;&#x4F9D;&#x6B21;&#x8BBF;&#x95EE;&#x5B83;&#x4EEC;&#x7684;&#x90BB;&#x63A5;&#x70B9;&#x3002;&#x6309;&#x7167;&#x6B64;&#x8FC7;&#x7A0B;&#xFF0C;&#x76F4;&#x5230;&#x56FE;&#x4E2D;&#x6240;&#x6709;&#x88AB;&#x8BBF;&#x95EE;&#x8FC7;&#x7684;&#x9876;&#x70B9;&#x7684;&#x90BB;&#x63A5;&#x70B9;&#x90FD;&#x88AB;&#x8BBF;&#x95EE;&#x5230;&#x3002;&#x6700;&#x540E;&#x8FD8;&#x9700;&#x8981;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x5C31;&#x662F;&#x67E5;&#x770B;&#x56FE;&#x4E2D;&#x662F;&#x5426;&#x5B58;&#x5728;&#x5C1A;&#x672A;&#x88AB;&#x8BBF;&#x95EE;&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x82E5;&#x6709;&#xFF0C;&#x5219;&#x4EE5;&#x8BE5;&#x9876;&#x70B9;&#x4E3A;&#x8D77;&#x59CB;&#x70B9;&#xFF0C;&#x91CD;&#x590D;&#x4E0A;&#x8FF0;&#x904D;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><strong>&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x751F;&#x6210;&#x6811;&#x548C;&#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x751F;&#x6210;&#x6811;</strong></p>
<p>&#x7531;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#x5F97;&#x5230;&#x7684;&#x6811;&#x4E3A;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x751F;&#x6210;&#x6811;&#xFF0C;&#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#x751F;&#x6210;&#x7684;&#x6811;&#x4E3A;&#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x751F;&#x6210;&#x6811;</p>
<footer class="page-footer-ex"> <span class="page-footer-ex-copyright"> &#xA9; All Rights Reserved </span> &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; <span class="page-footer-ex-footer-update"> updated 2020-02-24 02:32:04 </span> </footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../chapter02/JDSChapter02.html" class="navigation navigation-next " aria-label="Next page: java基本类型与包装类">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"数据结构理论","level":"1.2","depth":1,"next":{"title":"java基本类型与包装类","level":"1.3","depth":1,"path":"chapter02/JDSChapter02.md","ref":"./chapter02/JDSChapter02.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","code","page-footer-ex","-sharing","sharing-plus","theme-comscore","prism","-highlight"],"styles":{"website":"styles/vue.css"},"pluginsConfig":{"prism":{"css":["prismjs/themes/prism-tomorrow.css"]},"page-footer-ex":{"copyright":"© All Rights Reserved","markdown":false,"update_format":"YYYY-MM-DD HH:mm:ss","update_label":"updated"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-comscore":{},"sharing":{"qq":true,"all":["facebook","google","twitter","weibo","qq","linkedin","qzone","douban"],"douban":false,"facebook":false,"weibo":true,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":false,"messenger":false,"line":false,"vk":false,"pocket":false,"google":false,"viber":false,"stumbleupon":false,"qzone":true,"linkedin":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Laglangyue","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"SQL数据结构","language":"zh-hans","gitbook":"3.2.3","description":"SQL数据结构"},"file":{"path":"chapter01/JDSChapter01.md","mtime":"2020-02-23T18:32:04.433Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-03-06T16:56:13.622Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

